nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_i2c.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.dsc_i2c"
#endif

/*! brief i2c master transfer state, used in I2C driver internal master transfer state machine. */
enum _i2c_master_transfer_states
{
    kMasterIdleState             = 0x0U, /*!< I2C bus idle. */
    kMasterCheckAddressState     = 0x1U, /*!< 7-bit address check state. */
    kMasterSendCommandState      = 0x2U, /*!< Send command byte phase. */
    kMasterSendDataState         = 0x3U, /*!< Send data transfer phase. */
    kMasterReceiveDataBeginState = 0x4U, /*!< Receive data transfer phase begin. */
    kMasterReceiveDataState      = 0x5U, /*!< Receive data transfer phase. */
#if I2C_SMBUS_ENABLE
    kMasterCheckSentPecResponseState = 0x6U, /*!< Check slave's response to the PEC byte state. */
    kMasterCheckReceivedPecState     = 0x7U, /*!< Check received PEC bytes with the calculated CRC value. */
#endif                                       /* I2C_SMBUS_ENABLE */
};

/*! brief i2c slave transfer state, used in I2C driver internal slave transfer IRQ handler. */
enum _i2c_slave_transfer_states
{
    kSlaveTurnedOffState = 0x0U,
    kSlaveIdleState      = 0x1U, /*!< I2C bus idle, slave ready to process bus events. */
    kSlaveBusyState      = 0x2U, /*!< I2C bus busy, slave has detected bus event(s). */
#if I2C_SMBUS_ENABLE
    kSlaveCheckReceivedPecState = 0x3U, /*!< Check received PEC bytes with the calculated CRC value. */
    kSlaveSendPECState          = 0x4U,
#endif /* I2C_SMBUS_ENABLE */
};

/*! brief Typedef for interrupt handler. */
typedef void (*i2c_isr_t)(void *i2cHandle);

/*! brief static variable to keep current configured baudrate. */
#if (I2C_MASTER_FACK_CONTROL || I2C_SMBUS_ENABLE)
static uint32_t s_u32Baudrate = 100000;
#endif /* I2C_MASTER_FACK_CONTROL/I2C_SMBUS_ENABLE */

/*! brief static variable to keep current configured baudrate. */
#if I2C_SMBUS_ENABLE
static uint8_t s_u8MasterCrcValue = 0U;
static uint8_t s_u8SlaveCrcValue  = 0U;
static bool s_bIsMaster;
#endif /* I2C_SMBUS_ENABLE */

/*******************************************************************************
 * Driver Internal Functions Declaration
 ******************************************************************************/

/*!
 * @brief Sets SCL/SDA hold time for slave.
 *
 * This API receives SCL stop hold time, calculates the closest SCL divider and MULT value for the SDA hold time, SCL
 * start and SCL stop hold time. To reduce the ROM size, SDA/SCL hold value mapping table is not provided,
 * assume SCL divider = SCL stop hold value *2 to get the closest SCL divider value and MULT value, then the related SDA
 * hold time, SCL start and SCL stop hold time is used.
 *
 * @param base I2C base pointer.
 * @param u32SourceClock_Hz I2C functional clock frequency in Hertz.
 * @param u32SclStopHoldTime_ns SCL stop hold time in ns.
 */
static void I2C_SetHoldTime(I2C_Type *base, uint32_t u32SclStopHoldTime_ns, uint32_t u32SourceClock_Hz);

/*!
 * @brief Checks and clears error status during master transfer.
 *
 * @param base I2C base pointer.
 * @param u32Status current i2c hardware status.
 * @retval kStatus_Success No error found.
 * @retval #kStatus_I2C_ArbitrationLost Transfer error, arbitration lost.
 * @retval #kStatus_I2C_Nak Received Nak error.
 */
static status_t I2C_MasterCheckAndClearError(I2C_Type *base, uint16_t u16Status);

/*!
 * @brief Initializes master tranfer software state machine.
 *
 * Sets up master transfer, sends slave address and set the initial transfer state of master software state machine.
 *
 * @param psHandle pointer to i2c_master_transfer_handle_t structure which stores the transfer state.
 * @param psTransferConfig pointer to i2c_master_transfer_t structure.
 */
static status_t I2C_MasterTransferInitStateMachine(i2c_master_transfer_handle_t *psHandle,
                                                   i2c_master_transfer_t *psTransferConfig);

/*!
 * @brief Runs master transfer softerware state machine to perform transfer.
 *
 * Master software state machine controls transfer state, perfroms master data transfer according to user's transfer
 * configuration. For example, if user sets the transfer configuration @ref i2c_master_transfer_t to perform master read
 * with command, after start signal and slave adderss are issued, the proper transfer state should be in such order:
 * kMasterCheckAddressState: Check if master was nacked during slave probing
 * kMasterSendCommandState: Send command data, if it is master read operation, issue re-start and address
 * kMasterReceiveDataBeginState: Set bus direction to receive and send nack signal if only one byte data is to be read.
 * kMasterReceiveDataState: Recieve data. Send stop signal if #kI2C_TransferNoStopFlag is not configured.
 * Master software state machine is designed to check the curent state stored by i2c_master_transfer_handle_t::u8State,
 * performs curent state's transfer process and set the state to the next accordingly. After all the states are
 * executed, bIsDone is set to true to indicate transfer completion.
 *
 * @param psHandle pointer to i2c_master_transfer_handle_t structure which stores the transfer state
 * @param bIsDone input param to get whether transfer is done, true is done
 * @retval kStatus_Success No error found.
 * @retval #kStatus_I2C_ArbitrationLost Transfer error, arbitration lost.
 * @retval #kStatus_I2C_Nak Received Nak error.
 * @retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 */
static status_t I2C_MasterTransferRunStateMachine(i2c_master_transfer_handle_t *psHandle, bool *bIsDone);

/*!
 * @brief Master interrupt handler.
 *
 * @param pI2CHandle pointer to i2c_master_transfer_handle_t structure.
 */
void I2C_MasterTransferHandleIRQ(void *pI2CHandle);

/*!
 * @brief Slave interrupt handler.
 *
 * @param pI2CHandle pointer to i2c_slave_transfer_handle_t structure which stores the transfer state
 */
void I2C_SlaveTransferHandleIRQ(void *pI2CHandle);

