nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
#if I2C_SMBUS_ENABLE
/*!
 * @brief Calculate CRC-8 check value for PEC transfer.
 *
 * @param pu8CrcValue Pointer to the calculated CRC value. If several sections of data need to be calculated separately,
 * point this pointer to the previously calculated CRC value
 * @param pu8Data Pointer to the data to be calculated
 * @param u16ByteCount Total byte count for current CRC calculation
 */
void I2C_UpdateCrc8(uint8_t *pu8CrcValue, uint8_t *pu8Data, uint16_t u16ByteCount);
#endif /* I2C_SMBUS_ENABLE */

/*!
 * @brief I2C common interrupt handler.
 *
 * @param pHandle pointer to i2c_master_transfer_handle_t structure which stores the transfer state
 */
static void I2C_TransferCommonIRQHandler(I2C_Type *base, void *pHandle);

#if (I2C_MASTER_FACK_CONTROL || I2C_SMBUS_ENABLE)
static void I2C_AckByte(I2C_Type *base, bool bAck)
{
    /* Issue Acknowledge on read. */
    I2C_SendAck(base, bAck);

    /* Delay at least one bit time */
    SDK_DelayAtLeastUs(1000000 / s_u32Baudrate, SystemCoreClock);

    /* Do dummy read. */
    (void)I2C_ReadByte(base);
}
#endif /* I2C_MASTER_FACK_CONTROL/I2C_SMBUS_ENABLE */

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! brief Pointers to i2c handles for each instance. */
static void *s_pI2cHandles[FSL_FEATURE_SOC_I2C_COUNT];

/*! brief SCL clock divider used for calculating baud rate. */
static const uint16_t s_u16I2cDividerTable[] = {
    20,  22,  24,  26,   28,   30,   34,   40,   28,   32,   36,   40,   44,   48,   56,   68,
    48,  56,  64,  72,   80,   88,   104,  128,  80,   96,   112,  128,  144,  160,  192,  240,
    160, 192, 224, 256,  288,  320,  384,  480,  320,  384,  448,  512,  576,  640,  768,  960,
    640, 768, 896, 1024, 1152, 1280, 1536, 1920, 1280, 1536, 1792, 2048, 2304, 2560, 3072, 3840};

/*! brief Pointers to i2c IRQ number for each instance. */
static const IRQn_Type s_eI2cIrqs[] = I2C_IRQS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! brief Pointers to i2c clocks for each instance. */
static const clock_ip_name_t s_eI2cClocks[] = I2C_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*! brief Pointer to master IRQ handler for each instance. */
static i2c_isr_t s_pfI2cMasterIsr;

/*! brief Pointer to slave IRQ handler for each instance. */
static i2c_isr_t s_pfI2cSlaveIsr;

/*! brief Pointers to i2c bases for each instance. */
static I2C_Type *const s_pfI2cBases[] = I2C_BASE_PTRS;

/*******************************************************************************
 * Codes
 ******************************************************************************/

/* =========================================== Functional Group API List ============================================ */
/* ---------------------------------------- Hardware Status Flags Sub-group ----------------------------------------- */
/*!
 * brief Gets the I2C hardware status flags.
 *
 * param base I2C base pointer
 * return the mask of status flags, can be a single flag or several flags in #_i2c_status_flags ORed together.
 */
uint16_t I2C_MasterGetStatusFlags(I2C_Type *base)
{
    uint16_t u16StatusFlags = (uint16_t)base->S;

    /* Look up the SCL/SDA timeout bit from the SMB register. */
    if (0U != (base->SMB & (I2C_SMB_SLTF_MASK)))
    {
        u16StatusFlags |= (uint16_t)kI2C_SclLowTimeoutFlag;
    }
    if (0U != (base->SMB & (I2C_SMB_SHTF2_MASK)))
    {
        u16StatusFlags |= (uint16_t)kI2C_SdaLowTimeoutInterruptFlag;
    }
#ifdef I2C_HAS_STOP_DETECT
    /* Look up the STOPF bit from the filter register. */
    if (0U != (base->FLT & I2C_FLT_STOPF_MASK))
    {
        u16StatusFlags |= (uint16_t)kI2C_StopDetectInterruptFlag;
    }
#endif

#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    /* Look up the STARTF bit from the filter register. */
    if (0U != (base->FLT & I2C_FLT_STARTF_MASK))
    {
        u16StatusFlags |= (uint16_t)kI2C_StartDetectInterruptFlag;
    }
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */

    return u16StatusFlags;
}
/* -------------------------------------- End of Hardware Status Flags Sub-group ------------------------------------ */

/* ----------------------------------------------- Interrupt Sub-group ---------------------------------------------- */
/*!
 * brief Enables I2C interrupt source.
 *
 * note Before enabling kI2C_GlobalInterruptEnable, check kI2C_RangeAddressMatchInterruptFlag and
 * kI2C_AddressAsSlaveInterruptFlag first, because any write operation on C1 will clear these 2 bits.
 *
 * param base I2C base pointer
 * param u8Interrupts The interrupt source mask, can be a single source or several sources in #_i2c_interrupt_enable
 * ORed together.
 */
void I2C_EnableInterrupts(I2C_Type *base, uint8_t u8Interrupts)
{
#ifdef I2C_HAS_STOP_DETECT
    uint8_t u8FLTReg;
#endif

    if (0U != (u8Interrupts & (uint8_t)kI2C_GlobalInterruptEnable))
    {
        base->C1 |= I2C_C1_IICIE_MASK;
    }

    if (0U != (u8Interrupts & (uint8_t)kI2C_SdaLowTimeoutInterruptEnable))
    {
        base->SMB |= I2C_SMB_SHTF2IE_MASK;
    }

#if defined(FSL_FEATURE_I2C_HAS_STOP_DETECT) && FSL_FEATURE_I2C_HAS_STOP_DETECT
    if (0U != (u8Interrupts & (uint8_t)kI2C_StopDetectInterruptEnable))
    {
        u8FLTReg = base->FLT;
        /* Avoid writing 1 to STOPF and clears the flag accidentally. */
        u8FLTReg &= ~I2C_FLT_STOPF_MASK;
        /* Enable Stop detect. */
        u8FLTReg |= I2C_FLT_STOPIE_MASK;
        base->FLT = u8FLTReg;
    }
#endif /* FSL_FEATURE_I2C_HAS_STOP_DETECT */

#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    if (0U != (u8Interrupts & (uint8_t)kI2C_StartStopDetectInterruptEnable))
    {
        u8FLTReg = base->FLT;
        /* Avoid writing 1 to STOPF/STARTF and clears the flags accidentally. */
        u8FLTReg &= ~(uint8_t)(I2C_FLT_STOPF_MASK | I2C_FLT_STARTF_MASK);
        /* Start and stop detect enable. */
        u8FLTReg |= I2C_FLT_SSIE_MASK;
        base->FLT = u8FLTReg;
    }
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */
}

/*!
 * brief Disables I2C interrupt source.
 *
 * note Before disabling kI2C_GlobalInterruptEnable, check kI2C_RangeAddressMatchInterruptFlag and
 * kI2C_AddressAsSlaveInterruptFlag first, because any write operation on C1 will clear these 2 bits.
 *
 * param base I2C base pointer
 * param u8Interrupts The interrupt source mask, can be a single source or several sources in #_i2c_interrupt_enable
 * ORed together.
 */
void I2C_DisableInterrupts(I2C_Type *base, uint8_t u8Interrupts)
{
    if (0U != (u8Interrupts & (uint8_t)kI2C_GlobalInterruptEnable))
    {
        base->C1 &= ~(uint8_t)I2C_C1_IICIE_MASK;
    }

    if (0U != (u8Interrupts & (uint8_t)kI2C_SdaLowTimeoutInterruptEnable))
    {
        base->SMB &= ~(uint8_t)I2C_SMB_SHTF2IE_MASK;
    }

#if defined(FSL_FEATURE_I2C_HAS_STOP_DETECT) && FSL_FEATURE_I2C_HAS_STOP_DETECT
    if (0U != (u8Interrupts & (uint8_t)kI2C_StopDetectInterruptEnable))
    {
        base->FLT &= ~(I2C_FLT_STOPIE_MASK | I2C_FLT_STOPF_MASK);
    }
#endif /* FSL_FEATURE_I2C_HAS_STOP_DETECT */

#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    if (0U != (u8Interrupts & (uint8_t)kI2C_StartStopDetectInterruptEnable))
    {
        base->FLT &= ~(uint8_t)(I2C_FLT_SSIE_MASK | I2C_FLT_STOPF_MASK | I2C_FLT_STARTF_MASK);
    }
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */
}

/*!
 * brief Get all the enabled interrupt sources.
 *
 * param base I2C base pointer
 * return The interrupt source mask, can be a single source or several sources in #_i2c_interrupt_enable ORed
 * together.
 */
uint8_t I2C_GetEnabledInterrupts(I2C_Type *base)
{
    uint8_t u8Interrupts = 0U;
    if (0U != (base->C1 & (uint8_t)I2C_C1_IICIE_MASK))
    {
        u8Interrupts |= (uint8_t)kI2C_GlobalInterruptEnable;
    }

    if (0U != (base->SMB & (uint8_t)I2C_SMB_SHTF2IE_MASK))
    {
        u8Interrupts |= (uint8_t)kI2C_SdaLowTimeoutInterruptEnable;
    }
#ifdef I2C_HAS_STOP_DETECT
    if (0U != (base->FLT & (uint8_t)(I2C_FLT_SSIE_MASK)))
    {
#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
        u8Interrupts |= (uint8_t)kI2C_StartStopDetectInterruptEnable;
#elif defined(FSL_FEATURE_I2C_HAS_STOP_DETECT) && FSL_FEATURE_I2C_HAS_STOP_DETECT
        u8Interrupts |= (uint8_t)kI2C_StopDetectInterruptEnable;
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT/FSL_FEATURE_I2C_HAS_STOP_DETECT */
    }
#endif
    return u8Interrupts;
}
/* ------------------------------------------- End of Interrupt Sub-group ------------------------------------------- */

/* ------------------------------------------ Module Init/Deinit Sub-group ------------------------------------------ */
/*!
 * brief Sets the I2C master configuration structure to default values.
 *
 * The purpose of this API is to initialize the configuration structure to default value for @ref I2C_MasterInit to use.
 * Use the unchanged structure in @ref I2C_MasterInit or modify the structure before calling @ref I2C_MasterInit.
 * This is an example:
 * code
 *   i2c_master_config_t config;
 *   I2C_MasterGetDefaultConfig(&config, 12000000U);
 *   config.u32BaudRateBps = 100000;
 *   I2C_MasterInit(I2C0, &config);
 * endcode
 *
 * param psMasterConfig Pointer to the master configuration structure.
 * param u32SrcClockHz The clock source frequency for I2C module.
 */
void I2C_MasterGetDefaultConfig(i2c_master_config_t *psMasterConfig, uint32_t u32SrcClockHz)
{
    assert(NULL != psMasterConfig);
    assert(0U != u32SrcClockHz);

    /* Initializes the configure structure to zero. */
    (void)memset(psMasterConfig, 0, sizeof(*psMasterConfig));

