nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
    /* Disable the I2C peripheral. */
    psMasterConfig->bEnableModule = false;

    /* Save the module's clock frequency. */
    psMasterConfig->u32SrcClockHz = u32SrcClockHz;

    /* Default disable the I2C high drive. */
    psMasterConfig->bEnableHighDrive = false;

#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
    /* Default enable double buffering. */
    psMasterConfig->bEnableDoubleBuffering = true;
#endif /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */
#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
    /* Default stop hold enable is disabled. */
    psMasterConfig->bEnableStopHold = false;
#endif /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */

    /* Default glitch filter value is 200ns. */
    psMasterConfig->u8GlitchFilterWidth = 200U;

#if I2C_SMBUS_ENABLE
    /* SMBus defines a clock low timeout of 35 ms, use this as default value. */
    psMasterConfig->u16SclTimout_Ms = 35;
#endif /* I2C_SMBUS_ENABLE */

    /* Default do not enable any interrupts. */
    psMasterConfig->u8Interrupts = 0U;
    /* Default baud rate at 100kbps. */
    psMasterConfig->u32BaudRateBps = 100000U;
}

/*!
 * brief Initializes the I2C peripheral to operate as master.
 *
 * This API initialize the I2C module for master operation, including the feature configuration of high drive capacity,
 * doubble buffer, glitch filter, SCL timeout value, stop hold off enable and transfer baudrate. User can also configure
 * whether to enable the module in the function.
 *
 * note If FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL is enbaled by user, the init function will not ungate I2C clock source
 * before initialization, to avoid hardfault, user has to manually enable ungate the clock source before calling the API
 * The configuration structure can be filled manully or be set with default values by calling
 *
 * @ref I2C_MasterGetDefaultConfig. This is an example.
 * code
 *   I2C_MasterGetDefaultConfig(&config, 12000000U);
 *   I2C_MasterInit(I2C0, &config);
 * endcode
 *
 * param base I2C base pointer
 * param psMasterConfig Pointer to the master configuration structure
 */
void I2C_MasterInit(I2C_Type *base, const i2c_master_config_t *psMasterConfig)
{
    assert(NULL != psMasterConfig);
    assert(0U != psMasterConfig->u32SrcClockHz);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Enable I2C clock. */
    CLOCK_EnableClock(s_eI2cClocks[I2C_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    /* Set the I2C register value to reset value. */
    I2C_Reset(base);

    /* Clear all flags. */
    I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_StatusAllFlags);
    /* Configure high drive. */
    I2C_EnableHighDrive(base, psMasterConfig->bEnableHighDrive);
    /* Enable/Disable double buffering. */
#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
    I2C_EnableDoubleBuffer(base, psMasterConfig->bEnableDoubleBuffering);
#endif /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */
    /* Configure the glitch filter value. */
    I2C_SetGlitchFilter(base, psMasterConfig->u8GlitchFilterWidth, psMasterConfig->u32SrcClockHz);
#if I2C_SMBUS_ENABLE
    /* Configure timeout value. */
    I2C_SetSclTimeoutValue(base, psMasterConfig->u16SclTimout_Ms, psMasterConfig->u32SrcClockHz);
#endif /* I2C_SMBUS_ENABLE */

#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
    I2C_EnableStopHold(base, psMasterConfig->bEnableStopHold);
#endif /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */
    /* Configure baud rate. */
    I2C_MasterSetBaudRate(base, psMasterConfig->u32BaudRateBps, psMasterConfig->u32SrcClockHz);

    /* Enable the I2C peripheral based on the configuration. */
    I2C_Enable(base, psMasterConfig->bEnableModule);

    I2C_EnableInterrupts(base, psMasterConfig->u8Interrupts);
}

/*!
 * brief De-initializes the I2C peripheral. Call this API to disable the I2C module.
 *
 * param base I2C base pointer
 */
void I2C_MasterDeinit(I2C_Type *base)
{
    /* Disable I2C module. */
    I2C_Enable(base, false);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Disable I2C clock. */
    CLOCK_DisableClock(s_eI2cClocks[I2C_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief Sets the I2C slave configuration structure to default values.
 *
 * The purpose of this API is to initialize the configuration structure for @ref I2C_SlaveInit to use. Use the unchanged
 * initialized structure in @ref I2C_SlaveInit or modify the structure before calling @ref I2C_SlaveInit.
 * This is an example.
 * code
 *   i2c_slave_config_t config;
 *   I2C_SlaveGetDefaultConfig(&config, 0x23U, 12000000U);
 * endcode
 *
 * param psSlaveConfig Pointer to the slave configuration structure.
 * param u16PrimaryAddress slave address. For 7-bit address low 7-bit is used, for 10-bit address low 10-bit is used.
 * param u32SrcClockHz The clock source frequency for I2C module.
 */
void I2C_SlaveGetDefaultConfig(i2c_slave_config_t *psSlaveConfig, uint16_t u16PrimaryAddress, uint32_t u32SrcClockHz)
{
    assert(NULL != psSlaveConfig);
    assert(0U != u32SrcClockHz);

    /* Initializes the configure structure to zero. */
    (void)memset(psSlaveConfig, 0, sizeof(*psSlaveConfig));

    /* Save the module's clock frequency. */
    psSlaveConfig->u32SrcClockHz = u32SrcClockHz;

    /* Disable the I2C peripheral. */
    psSlaveConfig->bEnableModule = false;

    /* Default disable the I2C high drive. */
    psSlaveConfig->bEnableHighDrive = false;

#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
    /* Default enable double buffering. */
    psSlaveConfig->bEnableDoubleBuffering = true;
#endif /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */
#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
    /* Default stop hold enable is disabled. */
    psSlaveConfig->bEnableStopHold = false;
#endif /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */
    /* Default glitch filter value is 200ns. */
    psSlaveConfig->u8GlitchFilterWidth = 200U;

    /* Slave address match waking up MCU from low power mode is disabled. */
    psSlaveConfig->bEnableWakeUp = false;

#if !(defined(FSL_FEATURE_I2C_NO_SBRC) && FSL_FEATURE_I2C_NO_SBRC)
    /* Independent slave mode baud rate at maximum frequency is disabled. */
    psSlaveConfig->bEnableBaudRateCtl = false;
#endif /* FSL_FEATURE_I2C_NO_SBRC */

    /* General call mode is enabled by default. */
    psSlaveConfig->bEnableGeneralCall = true;

    /* By default slave is addressed with 7-bit single address. */
    psSlaveConfig->eAddressingMode = kI2C_AddressMatch;

    psSlaveConfig->bitsPrimaryAddress = u16PrimaryAddress;

