nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
#if I2C_SMBUS_ENABLE
    /* SMBus defines a clock low timeout of 35 ms, use this as default value. */
    psSlaveConfig->u16SclTimout_Ms = 35;
    /* Alert response is enabled by default. */
    psSlaveConfig->bEnableAlertResponse = true;
    /* Secondary address is disabled by default. */
    psSlaveConfig->bEnableSecondaryAddress = false;
#endif /* I2C_SMBUS_ENABLE */
    /* Default do not enable any interrupts. */
    psSlaveConfig->u8Interrupts = 0U;
    /* Set default SCL stop hold time to 4us which is minimum requirement in I2C spec. */
    psSlaveConfig->u32SclStopHoldTime_ns = 4000U;
}

/*!
 * brief Initializes the I2C peripheral to operate as slave.
 *
 * This API initialize the I2C module for slave operation, including the feature configuration of high drive capacity,
 * doubble buffer, glitch filter, SCL timeout value, stop hold off enable, addressing mode, alert response/general call
 * minitoring, auto baudrate control, low power mode wake up, SCL/SDA setup and hold time. User can also configure
 * whether to enable the module in the function.
 *
 * note If FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL is enbaled by user, the init function will not ungate I2C clock source
 * before initialization, to avoid hardfault, user has to manually enable ungate the clock source before calling the API
 *
 * The configuration structure can be filled manully or be set with default values by calling
 * @ref I2C_SlaveGetDefaultConfig. This is an example.
 * code
 *    i2c_slave_config_t sConfig;
 *    I2C_SlaveGetDefaultConfig(&sConfig, 0x2AU, 12000000U);
 *    I2C_SlaveInit(I2C0, &sConfig);
 * endcode
 *
 * param base I2C base pointer
 * param psSlaveConfig Pointer to the slave configuration structure
 */
void I2C_SlaveInit(I2C_Type *base, const i2c_slave_config_t *psSlaveConfig)
{
    assert(NULL != psSlaveConfig);
    assert(psSlaveConfig->bitsPrimaryAddress != 0U);
    assert(0U != psSlaveConfig->u32SrcClockHz);
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    CLOCK_EnableClock(s_eI2cClocks[I2C_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    uint8_t u8tmpReg;
    /* Reset the module. */
    I2C_Reset(base);

    /* Set hold time. */
    I2C_SetHoldTime(base, psSlaveConfig->u32SclStopHoldTime_ns, psSlaveConfig->u32SrcClockHz);

    /* Configure the glitch filter value. */
    I2C_SetGlitchFilter(base, psSlaveConfig->u8GlitchFilterWidth, psSlaveConfig->u32SrcClockHz);

#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
    /* Configure the stop / hold enable. */
    I2C_EnableStopHold(base, psSlaveConfig->bEnableStopHold);
#endif /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */
    /* Configure addressing mode. */
    I2C_SlaveSetAddressingMode(base, (i2c_slave_address_mode_t)psSlaveConfig->eAddressingMode,
                               psSlaveConfig->bitsPrimaryAddress, psSlaveConfig->bitsMaxAddress);

#if I2C_SMBUS_ENABLE
    /* Configure SMBus feature, including alert response, secondary address and SCL timeout value. */
    u8tmpReg = base->SMB;
    u8tmpReg &= ~(uint8_t)(I2C_SMB_ALERTEN_MASK | I2C_SMB_SIICAEN_MASK);
    base->SMB = u8tmpReg | I2C_SMB_ALERTEN(psSlaveConfig->bEnableAlertResponse) |
                I2C_SMB_SIICAEN(psSlaveConfig->bEnableSecondaryAddress);
    base->A2 = (uint8_t)(((uint32_t)(psSlaveConfig->bitsSecondaryAddress)) << 1U);
    I2C_SetSclTimeoutValue(base, psSlaveConfig->u16SclTimout_Ms, psSlaveConfig->u32SrcClockHz);
#endif /* I2C_SMBUS_ENABLE */

    /* Configure general call, high drive and auto baud rate control. */
    u8tmpReg = base->C2;
#if !(defined(FSL_FEATURE_I2C_NO_SBRC) && FSL_FEATURE_I2C_NO_SBRC)
    u8tmpReg &= ~(uint8_t)(I2C_C2_SBRC_MASK | I2C_C2_GCAEN_MASK | I2C_C2_HDRS_MASK);
    u8tmpReg |= I2C_C2_SBRC(psSlaveConfig->bEnableBaudRateCtl) | I2C_C2_GCAEN(psSlaveConfig->bEnableGeneralCall) |
                I2C_C2_HDRS(psSlaveConfig->bEnableHighDrive);
#else
    u8tmpReg &= ~(uint8_t)(I2C_C2_GCAEN_MASK | I2C_C2_HDRS_MASK);
    u8tmpReg |= I2C_C2_GCAEN(psSlaveConfig->bEnableGeneralCall) | I2C_C2_HDRS(psSlaveConfig->bEnableHighDrive);
#endif /* FSL_FEATURE_I2C_NO_SBRC */
    base->C2 = u8tmpReg;

#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
    /* Enable/Disable double buffering. */
    I2C_EnableDoubleBuffer(base, psMasterConfig->bEnableDoubleBuffering);
#endif /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */

    /* Configure low power wake up feature and enable module. */
    u8tmpReg = base->C1;
    u8tmpReg &= ~(uint8_t)I2C_C1_WUEN_MASK;
    base->C1 = u8tmpReg | I2C_C1_WUEN(psSlaveConfig->bEnableWakeUp) | I2C_C1_IICEN(psSlaveConfig->bEnableModule);

    I2C_EnableInterrupts(base, psSlaveConfig->u8Interrupts);
}

/*!
 * brief Sets the I2C configuration structure to default values.
 *
 * The purpose of this API is to initialize the configuration structure for @ref I2C_Init to use. Use the unchanged
 * initialized structure in @ref I2C_Init or modify the structure before calling @ref I2C_Init.
 * This is an example.
 * code
 *   i2c_config_t config;
 *   I2C_GetDefaultConfig(&config, 0x23U, 12000000U);
 * endcode
 *
 * param psConfig Pointer to the slave configuration structure.
 * param u16PrimaryAddress slave address. For 7-bit address low 7-bit is used, for 10-bit address low 10-bit is used.
 * param u32SrcClockHz The clock source frequency for I2C module.
 */
void I2C_GetDefaultConfig(i2c_config_t *psConfig, uint16_t u16PrimaryAddress, uint32_t u32SrcClockHz)
{
    assert(NULL != psConfig);
    assert(0U != u32SrcClockHz);

    /* Initializes the configure structure to zero. */
    (void)memset(psConfig, 0, sizeof(*psConfig));

    /* Default disable high drive. */
    psConfig->bEnableHighDrive = false;
#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
    /* Default disable double buffering. */
    psConfig->bEnableDoubleBuffering = false;
#endif /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */
#if I2C_SMBUS_ENABLE
    /* SMBus defines a clock low timeout of 35 ms, use this as default value. */
    psConfig->u16SclTimout_Ms = 35;
    /* Alert response is enabled by default. */
    psConfig->bEnableAlertResponse = true;
    /* Secondary address is disabled by default. */
    psConfig->bEnableSecondaryAddress = false;
#endif /* I2C_SMBUS_ENABLE */
    /* Slave address match waking up MCU from low power mode is disabled. */
    psConfig->bEnableWakeUp = false;
#if !(defined(FSL_FEATURE_I2C_NO_SBRC) && FSL_FEATURE_I2C_NO_SBRC)
    /* Independent slave mode baud rate at maximum frequency is disabled. */
    psConfig->bEnableBaudRateCtl = false;
#endif /* FSL_FEATURE_I2C_NO_SBRC */
    /* General call mode is enabled by default. */
    psConfig->bEnableGeneralCall = true;
    /* By default slave is addressed with 7-bit single address. */
    psConfig->eAddressingMode = kI2C_AddressMatch;

