nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
    /* Default baud rate at 100kbps. */
    psConfig->u32BaudRateBps = 100000U;
#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
    /* Default stop hold enable is disabled. */
    psConfig->bEnableStopHold = false;
#endif /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */
    /* Default glitch filter value is no filter. */
    psConfig->u8GlitchFilterWidth = 200U;

    psConfig->bitsPrimaryAddress = u16PrimaryAddress;

    /* Disable the I2C peripheral. */
    psConfig->bEnableModule = false;
    /* Default do not enable any interrupts. */
    psConfig->u8Interrupts = 0U;
    /* Save the module's clock frequency. */
    psConfig->u32SrcClockHz = u32SrcClockHz;
}

/*!
 * brief Initializes the I2C peripheral.
 *
 * This API initialize the I2C module, including the feature configuration of high drive capacity, doubble buffer,
 * glitch filter, SCL timeout value, stop hold off enable, addressing mode, alert response/general call minitoring, auto
 * baudrate control, low power mode wake up and baudrate. User can also configure whether to enable the module in the
 * function.
 *
 * note If FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL is enbaled by user, the init function will not ungate I2C clock source
 * before initialization, to avoid hardfault, user has to manually enable ungate the clock source before calling the API
 *
 * The configuration structure can be filled manully or be set with default values by calling @ref I2C_GetDefaultConfig.
 * This is an example.
 * code
 *   i2c_config_t sConfig;
 *   I2C_GetDefaultConfig(&sConfig, 0x23U, 12000000U);
 *   I2C_Init(I2C0, &sConfig);
 * endcode
 *
 * param base I2C base pointer
 * param psConfig Pointer to the I2C configuration structure
 */
void I2C_Init(I2C_Type *base, const i2c_config_t *psConfig)
{
    assert(NULL != psConfig);
    assert(psConfig->bitsPrimaryAddress != 0U);
    assert(0U != psConfig->u32SrcClockHz);
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    CLOCK_EnableClock(s_eI2cClocks[I2C_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    uint8_t u8tmpReg;
    /* Reset the module. */
    I2C_Reset(base);

    /* Configure the glitch filter value. */
    I2C_SetGlitchFilter(base, psConfig->u8GlitchFilterWidth, psConfig->u32SrcClockHz);

#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
    /* Configure the stop / hold enable. */
    I2C_EnableStopHold(base, psConfig->bEnableStopHold);
#endif /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */

    /* Configure the glitch filter value. */
    I2C_SetGlitchFilter(base, psConfig->u8GlitchFilterWidth, psConfig->u32SrcClockHz);

    /* Configure addressing mode. */
    I2C_SlaveSetAddressingMode(base, (i2c_slave_address_mode_t)psConfig->eAddressingMode, psConfig->bitsPrimaryAddress,
                               psConfig->bitsMaxAddress);

#if I2C_SMBUS_ENABLE
    /* Configure SMBus feature, including alert response, secondary address and SCL timeout value. */
    u8tmpReg = base->SMB;
    u8tmpReg &= ~(uint8_t)(I2C_SMB_ALERTEN_MASK | I2C_SMB_SIICAEN_MASK);
    base->SMB =
        u8tmpReg | I2C_SMB_ALERTEN(psConfig->bEnableAlertResponse) | I2C_SMB_SIICAEN(psConfig->bEnableSecondaryAddress);
    base->A2 = (uint8_t)(((uint32_t)(psConfig->bitsSecondaryAddress)) << 1U);
    I2C_SetSclTimeoutValue(base, psConfig->u16SclTimout_Ms, psConfig->u32SrcClockHz);
#endif /* I2C_SMBUS_ENABLE */

    /* Configure general call, high drive and auto baud rate control. */
    u8tmpReg = base->C2;
#if !(defined(FSL_FEATURE_I2C_NO_SBRC) && FSL_FEATURE_I2C_NO_SBRC)
    u8tmpReg &= ~(uint8_t)(I2C_C2_SBRC_MASK | I2C_C2_GCAEN_MASK | I2C_C2_HDRS_MASK);
    u8tmpReg |= I2C_C2_SBRC(psConfig->bEnableBaudRateCtl) | I2C_C2_GCAEN(psConfig->bEnableGeneralCall) |
                I2C_C2_HDRS(psConfig->bEnableHighDrive);
#else
    u8tmpReg &= ~(uint8_t)(I2C_C2_GCAEN_MASK | I2C_C2_HDRS_MASK);
    u8tmpReg |= I2C_C2_GCAEN(psConfig->bEnableGeneralCall) | I2C_C2_HDRS(psConfig->bEnableHighDrive);
#endif /* FSL_FEATURE_I2C_NO_SBRC */
    base->C2 = u8tmpReg;

#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
    /* Enable/Disable double buffering. */
    I2C_EnableDoubleBuffer(base, psConfig->bEnableDoubleBuffering);
#endif /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */

    /* Configure baudrate. */
    I2C_MasterSetBaudRate(base, psConfig->u32BaudRateBps, psConfig->u32SrcClockHz);
    /* Configure low power wake up feature and enable module. */
    u8tmpReg = base->C1;
    u8tmpReg &= ~(uint8_t)I2C_C1_WUEN_MASK;
    base->C1 = u8tmpReg | I2C_C1_WUEN(psConfig->bEnableWakeUp) | I2C_C1_IICEN(psConfig->bEnableModule);

    I2C_EnableInterrupts(base, psConfig->u8Interrupts);
}
/* --------------------------------------- End of Module Init/Deinit Sub-group -------------------------------------- */

/* ---------------------------------------- Peripheral Configuration Sub-group -------------------------------------- */
/*!
 * brief Sets the I2C SCL timeout value.
 *
 * After the I2C module is initialized, user can call this function to change the timeout value.
 *
 * param base I2C base pointer.
 * param u16SclTimout_Ms The SCL timeout value in ms.
 * param u32SrcClockHz I2C peripheral clock frequency in Hz
 */
void I2C_SetSclTimeoutValue(I2C_Type *base, uint16_t u16SclTimout_Ms, uint32_t u32SrcClockHz)
{
    /* Calculate timeout value. */
    uint32_t u32SclTimeoutValue = u16SclTimout_Ms * 512U * u32SrcClockHz / 1000U;

    /* If u32SclTimeoutValue exceeds the max boundary, use u32SrcClockHz/64 as counter. */
    if (u32SclTimeoutValue > UINT16_MAX)
    {
        u32SclTimeoutValue = MIN(UINT16_MAX, u32SclTimeoutValue / 64U);
        base->SMB &= ~I2C_SMB_TCKSEL_MASK;
    }
    base->SMB |= I2C_SMB_TCKSEL_MASK;

    base->SLTL = (uint8_t)u32SclTimeoutValue;
    base->SLTH = (uint8_t)(u32SclTimeoutValue >> 8U);
}

/*!
 * brief Sets the I2C master glitch filter width.
 *
 * After the I2C module is initialized as master, user can call this function to change the glitch filter width.
 *
 * param base I2C base pointer.
 * param u16GlitchFilter_Ns The GLitch filter length in nano seconds.
 * param u32SrcClockHz I2C peripheral clock frequency in Hz
 */
void I2C_SetGlitchFilter(I2C_Type *base, uint16_t u16GlitchFilter_Ns, uint32_t u32SrcClockHz)
{
    /* Calculate filter width. */
    uint32_t u32FilterWidth = u16GlitchFilter_Ns * u32SrcClockHz / 1000000000U;
    /* The maximum supported filter width is 15 I2C clock cycle. */
    u32FilterWidth = MIN(15U, u32FilterWidth);

    base->FLT &= ~(uint8_t)(I2C_FLT_FLT_MASK);
    base->FLT |= I2C_FLT_FLT(u32FilterWidth);
}

/*!
 * brief Sets the I2C master transfer baud rate.
 *
 * After the I2C module is initialized as master, user can call this function to change the transfer baud rate.
 *
 * param base I2C base pointer.
 * param u32BaudRateBps the baud rate value in bits-per-second.
 * param u32SrcClockHz I2C peripheral clock frequency in Hz
 */
void I2C_MasterSetBaudRate(I2C_Type *base, uint32_t u32BaudRateBps, uint32_t u32SrcClockHz)
{
    uint32_t u32Multiplier;
    uint32_t u32ComputedRate;
    uint32_t u32AbsError;
    uint32_t u32BestError = UINT32_MAX;
    uint32_t u32BestMult  = 0u;
    uint32_t u32BestIcr   = 0u;
    uint32_t u32Flag      = 1u;
    uint8_t u8Mult;
    uint8_t i;

