nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
    /* Search for the settings with the lowest error. Mult is the MULT field of the I2C_F register,
     * and ranges from 0-2. It selects the u32Multiplier factor for the divider. */
    for (u8Mult = 0u; u8Mult <= 2u; ++u8Mult)
    {
        if (u32BestError == 0u)
        {
            break;
        }

        u32Multiplier = u32Flag << u8Mult;

        /* Scan table to find best match. */
        for (i = 0u; i < sizeof(s_u16I2cDividerTable) / sizeof(uint16_t); ++i)
        {
            u32ComputedRate = u32SrcClockHz / (u32Multiplier * s_u16I2cDividerTable[i]);
            u32AbsError     = u32BaudRateBps > u32ComputedRate ? (u32BaudRateBps - u32ComputedRate) :
                                                             (u32ComputedRate - u32BaudRateBps);

            if (u32AbsError < u32BestError)
            {
                u32BestMult  = u8Mult;
                u32BestIcr   = i;
                u32BestError = u32AbsError;

                /* If the error is 0, then we can stop searching because we won't find a better match. */
                if (u32AbsError == 0u)
                {
                    break;
                }
            }
        }
    }

#if (I2C_MASTER_FACK_CONTROL || I2C_SMBUS_ENABLE)
    s_u32Baudrate = u32BaudRateBps;
#endif /* I2C_MASTER_FACK_CONTROL/I2C_SMBUS_ENABLE */
    /* Set frequency register based on best settings. */
    base->F = I2C_F_MULT(u32BestMult) | I2C_F_ICR(u32BestIcr);
}

/*!
 * brief Configure the slave addressing mode.
 *
 * After the I2C module is initialized as slave, user can call this function to change the configuration of slave
 * addressing mode.
 *
 * param base I2C base pointer.
 * param eAddressingMode The slave addressing mode, single address or range address.
 * param u16Address I2C slave address. For 7-bit address low 7-bit is used, for 10-bit address low 10-bit is used.
 * param u8MaxAddress The maximum boundary of slave address used in a range address match.
 */
void I2C_SlaveSetAddressingMode(I2C_Type *base,
                                i2c_slave_address_mode_t eAddressingMode,
                                uint16_t u16Address,
                                uint8_t u8MaxAddress)
{
    assert(base != NULL);
    switch (eAddressingMode)
    {
        case kI2C_AddressMatch:
            base->A1 = (uint8_t)(((uint32_t)(u16Address)) << 1U);
            base->C2 &= ~I2C_C2_RMEN_MASK;
            break;

        case kI2C_AddressRangeMatch:
            assert(u16Address < u8MaxAddress);
            base->A1 = (uint8_t)(((uint32_t)(u16Address)) << 1U);
            base->RA = (uint8_t)(((uint32_t)(u8MaxAddress)) << 1U);
            base->C2 |= I2C_C2_RMEN_MASK;
            break;

        case kI2C_AddressMatch10bit:
            base->A1         = (uint8_t)(((uint32_t)(u16Address)) << 1U);
            uint8_t u8TmpReg = base->C2;
            u8TmpReg &= ~((uint8_t)I2C_C2_RMEN_MASK | (uint8_t)I2C_C2_AD_MASK);
            u8TmpReg |= I2C_C2_AD(u16Address >> 7U) | I2C_C2_ADEXT_MASK;
            base->C2 = u8TmpReg;
            break;

        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }
}
/* ------------------------------------ End of Peripheral Configuration Sub-group ----------------------------------- */

/* --------------------------------------------- Bus Operation Sub-group -------------------------------------------- */
/*!
 * brief Sends a START signal on the I2C bus then the 7-bit slave address with transmit/receive bit
 *
 * This function is used to initiate a new transfer in master mode, by sending a START signal, then the slave address
 * with transmit/receive bit to I2C bus.
 *
 * note The return value of this API only indicates whether the start signal is sent to bus, user has to check
 * #kI2C_ArbitrationLostInterruptFlag and #kI2C_ArbitrationLostInterruptFlag using @ref I2C_MasterClearStatusFlags to
 * see if valid slave device is avaliable or the aribitration is lost.
 *
 * param base I2C base pointer
 * param u8Address 7-bit slave device address.
 * param eDirection Master transfer directions(transmit/receive).
 * retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 * retval kStatus_Success Successfully send the start signal.
 * retval kStatus_I2C_Busy Current bus is busy.
 */
status_t I2C_MasterStart(I2C_Type *base, uint8_t u8Address, i2c_master_transfer_direction_t eDirection)
{
    status_t result         = kStatus_Success;
    uint16_t u16StatusFlags = I2C_MasterGetStatusFlags(base);

    /* Return an error if the bus is already in use. */
    if (0U != (u16StatusFlags & (uint16_t)kI2C_BusBusyFlag))
    {
        result = kStatus_I2C_Busy;
    }
    else
    {
        /* Send the START signal. */
        base->C1 |= I2C_C1_MST_MASK | I2C_C1_TX_MASK;

#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFERING) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFERING
#if I2C_RETRY_TIMES
        uint32_t u32WaitTimes = I2C_RETRY_TIMES;
        while ((0U == (base->S2 & I2C_S2_EMPTY_MASK)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        while (0U == (base->S2 & I2C_S2_EMPTY_MASK))
        {
        }
#endif
#endif /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFERING */
        uint8_t u8StartByte = (uint8_t)(((uint32_t)u8Address) << 1U | ((eDirection == kI2C_MasterReceive) ? 1U : 0U));
        /* Send slave address + write/read bit. */
        I2C_WriteByte(base, u8StartByte);
#if I2C_SMBUS_ENABLE
        /* Set CRC to 0 only on start signal. */
        s_u8MasterCrcValue = 0U;
        I2C_UpdateCrc8(&s_u8MasterCrcValue, &u8StartByte, 1U);
#endif /* I2C_SMBUS_ENABLE */
    }

    return result;
}

/*!
 * brief Sends a repeated START signal, then the 7-bit slave address with transmit/receive bit to I2C bus.
 *
 * param base I2C peripheral base pointer
 * param u8Address 7-bit slave device address.
 * param eDirection Master transfer directions(transmit/receive).
 * retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 * retval kStatus_Success Successfully send the start signal.
 * retval kStatus_I2C_Busy Current bus is busy but not occupied by current I2C master.
 */
status_t I2C_MasterRepeatedStart(I2C_Type *base, uint8_t u8Address, i2c_master_transfer_direction_t eDirection)
{
    status_t result = kStatus_Success;
    uint8_t u8SavedMult;
    uint16_t u16StatusFlags = I2C_MasterGetStatusFlags(base);
    uint8_t u8TimeDelay     = 6;

    /* Return an error if the bus is already in use, but not by us. */
    if ((0U == (base->C1 & I2C_C1_MST_MASK)) && (0U != (u16StatusFlags & (uint16_t)kI2C_BusBusyFlag)))
    {
        result = kStatus_I2C_Busy;
    }
    else
    {
        u8SavedMult = base->F;
        base->F     = u8SavedMult & (~(uint8_t)I2C_F_MULT_MASK);
        /* We are already in a transfer, so send a repeated start. */
        base->C1 |= I2C_C1_RSTA_MASK | I2C_C1_TX_MASK;
        /* Restore the u32Multiplier factor. */
        base->F = u8SavedMult;

