nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
        /* Add some delay to wait for the Re-Start signal to be sent. */
        while (0U != (u8TimeDelay--))
        {
            __NOP();
        }

#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFERING) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFERING
#if I2C_RETRY_TIMES
        uint32_t u32WaitTimes = I2C_RETRY_TIMES;
        while ((0U == (base->S2 & I2C_S2_EMPTY_MASK)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        while (0U == (base->S2 & I2C_S2_EMPTY_MASK))
        {
        }
#endif
#endif /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFERING */
        uint8_t u8StartByte = (uint8_t)(((uint32_t)u8Address) << 1U | ((eDirection == kI2C_MasterReceive) ? 1U : 0U));
        /* Send slave address + write/read bit. */
        I2C_WriteByte(base, u8StartByte);
#if I2C_SMBUS_ENABLE
        I2C_UpdateCrc8(&s_u8MasterCrcValue, &u8StartByte, 1U);
#endif /* I2C_SMBUS_ENABLE */
    }

    return result;
}

/*!
 * brief Sends a STOP signal on the I2C bus.
 *
 * param base I2C base pointer
 * retval kStatus_Success Successfully send the stop signal.
 * retval kStatus_I2C_Timeout Send stop signal failed, timeout.
 */
status_t I2C_MasterStop(I2C_Type *base)
{
    status_t result = kStatus_Success;

    /* Issue the STOP command on the bus. */
    base->C1 &= ~(uint8_t)(I2C_C1_MST_MASK | I2C_C1_TX_MASK | I2C_C1_TXAK_MASK);

#if I2C_RETRY_TIMES
    uint32_t u32WaitTimes = I2C_RETRY_TIMES;
    /* Wait until bus not busy. */
    while ((0U != (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_BusBusyFlag)) && (0U != --u32WaitTimes))
    {
    }

    if (0U == u32WaitTimes)
    {
        result = kStatus_I2C_Timeout;
    }
#else
    /* Wait until data transfer complete. */
    while (0U != (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_BusBusyFlag))
    {
    }
#endif
    return result;
}

/*!
 * brief Sends a piece of data to I2C bus in master mode in blocking way.
 *
 * Call this function when using I2C as master to send certain bytes of data to bus when start signal is already sent.
 * User can specify whether to send a stop siganl after the data. This function uses the blocking way, which means it
 * does not return until all the data is sent to bus and stop signal is successfully issued(if user configures the stop
 * signal).
 *
 * note If I2C_SMBUS_ENABLE is enabled, an PEC byte will be sent after all the data bytes, and API will return
 * #kStatus_I2C_Pec_Error if slave nack the PEC.
 *
 * param base I2C base pointer.
 * param pu8TxBuff The pointer to the data to be transmitted.
 * param txSize The length in bytes of the data to be transmitted.
 * param bSendStop Whether to send stop signal after the data transfer.
 * retval kStatus_Success Successfully complete the data transmission.
 * retval kStatus_I2C_ArbitrationLost Transfer error, arbitration lost.
 * retval kStataus_I2C_Nak Transfer error, receive NAK during transfer.
 * retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 */
status_t I2C_MasterWriteBlocking(I2C_Type *base, const uint8_t *pu8Data, uint16_t txSize, bool bSendStop)
{
    status_t result         = kStatus_Success;
    uint16_t u16StatusFlags = 0;
    uint8_t u8Data;

#if I2C_RETRY_TIMES
    uint32_t u32WaitTimes = I2C_RETRY_TIMES;
    /* Wait until the data register is ready for transmit. */
    while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_ByteTransferCompleteInterruptFlag)) &&
           (0U != --u32WaitTimes))
    {
    }
    if (0U == u32WaitTimes)
    {
        return kStatus_I2C_Timeout;
    }
#else
    /* Wait until the data register is ready for transmit. */
    while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_ByteTransferCompleteInterruptFlag))
    {
    }
#endif

    /* Clear the IICIF flag. */
    I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

    /* Setup the I2C peripheral to transmit data. */
    I2C_SetTransferDirection(base, kI2C_Write);

    while (0U != (txSize--))
    {
        u8Data = *pu8Data++;
        /* Send a byte of data. */
        I2C_WriteByte(base, u8Data);
#if I2C_SMBUS_ENABLE
        I2C_UpdateCrc8(&s_u8MasterCrcValue, &u8Data, 1U);
#endif /* I2C_SMBUS_ENABLE */

#if I2C_RETRY_TIMES
        u32WaitTimes = I2C_RETRY_TIMES;
        /* Wait until data transfer complete. */
        while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        /* Wait until data transfer complete. */
        while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag))
        {
        }
#endif
        u16StatusFlags = I2C_MasterGetStatusFlags(base);

        /* Clear the IICIF flag. */
        I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

        /* Check if arbitration lost or no acknowledgement (NAK), return failure status. */
        if (0U != (u16StatusFlags & (uint16_t)kI2C_ArbitrationLostInterruptFlag))
        {
            I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_ArbitrationLostInterruptFlag);
            result = kStatus_I2C_ArbitrationLost;
        }
#if I2C_SMBUS_ENABLE
        /* For SMBus there is still a PEC byte following the last byte of data, cannot ignore the NACK. */
        if (0U != (u16StatusFlags & (uint16_t)kI2C_ReceiveNakFlag))
#else  /* I2C_SMBUS_ENABLE */
        /* If the last byte was nack, ignore */
        if ((0U != (u16StatusFlags & (uint16_t)kI2C_ReceiveNakFlag)) && (0U != txSize))
#endif /* I2C_SMBUS_ENABLE */
        {
            result = kStatus_I2C_Nak;
        }

        if (result != kStatus_Success)
        {
            /* Breaking out of the send loop. */
            break;
        }
    }

#if I2C_SMBUS_ENABLE
    /* Only send the PEC byte when stop signal is requested by user. */
    if (bSendStop)
    {
        I2C_WriteByte(base, s_u8MasterCrcValue);
    }
#if I2C_RETRY_TIMES
    u32WaitTimes = I2C_RETRY_TIMES;
    /* Wait until data transfer complete. */
    while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag)) && (0U != --u32WaitTimes))
    {
    }
    if (0U == u32WaitTimes)
    {
        return kStatus_I2C_Timeout;
    }
#else
    /* Wait until data transfer complete. */
    while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag))
    {
    }
#endif
    u16StatusFlags = I2C_MasterGetStatusFlags(base);
    result         = I2C_MasterCheckAndClearError(base, u16StatusFlags);
    /* If the PEC byte received with a NACK, set the transfer result to PEC error. */
    if (result == kStatus_I2C_Nak)
    {
        result = kStatus_I2C_Pec_Error;
    }
#endif /* I2C_SMBUS_ENABLE */

