nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
    /* If the transfer status is success and user required to send stop signal,
       or master was previously nacked by slave, send stop signal to finish the transfer. */
    if (((result == kStatus_Success) && (bSendStop)) || (result == kStatus_I2C_Nak)
#if I2C_SMBUS_ENABLE
        || (result == kStatus_I2C_Pec_Error)
#endif /* I2C_SMBUS_ENABLE */
    )
    {
        /* Clear the IICIF flag. */
        I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

        /* Send stop. */
        result = I2C_MasterStop(base);
    }

    return result;
}

/*!
 * brief Receives a piece of data from I2C bus in master mode in blocking way.
 *
 * Call this function when using I2C as master to receive certain bytes of data from bus when start signal is already
 * sent. User can specify whether to send a stop siganl after the data. This function uses the blocking way, which means
 * it does not return until all the data has been received and stop signal is successfully issued(if user configures the
 * stop signal).
 *
 * note If user configures to send stop signal after the data, this function stops the bus before reading the final
 * byte from data register. Without stopping the bus prior to the final read, the bus will issue another read, resulting
 * in garbage data being read into the data register.
 *
 * note If I2C_SMBUS_ENABLE is enabled, an PEC byte will be received after all the data bytes, and API will return
 * #kStatus_I2C_Pec_Error if the PEC does not match the calculation.
 *
 * param base I2C base pointer.
 * param pu8RxBuff The pointer to the data to store the received data.
 * param rxSize The length in bytes of the data to be received.
 * param bSendStop Whether to send stop signal after the data transfer.
 * retval kStatus_Success Successfully complete the data transmission.
 * retval kStatus_I2C_Timeout Send stop signal failed, timeout.
 */
status_t I2C_MasterReadBlocking(I2C_Type *base, uint8_t *pu8RxBuff, uint16_t rxSize, bool bSendStop)
{
    status_t result = kStatus_Success;
    uint8_t u8Data;

#if I2C_RETRY_TIMES
    uint32_t u32WaitTimes = I2C_RETRY_TIMES;
    /* Wait until the data register is ready for transmit. */
    while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_ByteTransferCompleteInterruptFlag)) &&
           (0U != --u32WaitTimes))
    {
    }
    if (0U == u32WaitTimes)
    {
        return kStatus_I2C_Timeout;
    }
#else
    /* Wait until the data register is ready for transmit. */
    while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_ByteTransferCompleteInterruptFlag))
    {
    }
#endif

    /* Clear the IICIF flag. */
    I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

#if I2C_MASTER_FACK_CONTROL
    I2C_EnableFastAck(base, true);
#endif

    /* Setup the I2C peripheral to receive data. */
    I2C_SetTransferDirection(base, kI2C_Read);

    /* Do dummy read. */
    (void)I2C_ReadByte(base);

#if (!I2C_SMBUS_ENABLE)
    if (rxSize == 1U)
    {
        /* Issue NACK on read. */
        I2C_SendAck(base, false);
#if I2C_MASTER_FACK_CONTROL
        I2C_EnableFastAck(base, false);
#endif
    }
#endif /* I2C_SMBUS_ENABLE */

    while (0U != (rxSize--))
    {
#if I2C_RETRY_TIMES
        u32WaitTimes = I2C_RETRY_TIMES;
        /* Wait until data transfer complete. */
        while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        /* Wait until data transfer complete. */
        while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag))
        {
        }
#endif

        if (rxSize == 0U)
        {
            if (bSendStop)
            {
#if I2C_SMBUS_ENABLE
                /* Check the PEC byte */
                I2C_SendAck(base, false);
#else
                /* Issue STOP command before reading last byte. */
                result = I2C_MasterStop(base);
#endif /* I2C_SMBUS_ENABLE */
            }
            else
            {
                /* Change direction to transmit to avoid extra clocks. */
                I2C_SetTransferDirection(base, kI2C_Write);
            }
        }

        /* Clear the IICIF flag. */
        I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

        /* Read from the data register. */
        u8Data       = I2C_ReadByte(base);
        *pu8RxBuff++ = u8Data;

#if I2C_SMBUS_ENABLE
        I2C_UpdateCrc8(&s_u8MasterCrcValue, &u8Data, 1U);
#else
#if I2C_MASTER_FACK_CONTROL
        if (rxSize != 0U)
        {
            I2C_AckByte(base, true);
        }
#endif

        if (rxSize == 1U)
        {
            I2C_SendAck(base, false);
#if I2C_MASTER_FACK_CONTROL
            /* Issue NACK on read. */
            I2C_EnableFastAck(base, false);
#endif
        }
#endif /* I2C_SMBUS_ENABLE */
    }

#if I2C_SMBUS_ENABLE
    /* Only check the PEC when stop signal should be sent to finish the transfer. */
    if (bSendStop)
    {
#if I2C_RETRY_TIMES
        u32WaitTimes = I2C_RETRY_TIMES;
        /* Wait until data transfer complete. */
        while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        /* Wait until data transfer complete. */
        while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag))
        {
        }
#endif
        /* Issue STOP command before reading last PEC byte. */
        result = I2C_MasterStop(base);
        /* Clear the IICIF flag. */
        I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);
        /* Read PEC byte from the data register and check with calculation. */
        if (I2C_ReadByte(base) != s_u8MasterCrcValue)
        {
            result = kStatus_I2C_Pec_Error;
        }
    }
#endif /* I2C_SMBUS_ENABLE */

    return result;
}

/*!
 * brief Sends a piece of data to I2C bus in slave mode in blocking way.
 *
 * Call this funtion to let I2C slave poll register status until it is addressed, then slave sends txSize of data to bus
 * until all the data has been sent to bus or untill it is nacked.
 *
 * param base I2C base pointer.
 * param pu8TxBuff The pointer to the data to be transferred.
 * param txSize The length in bytes of the data to be transferred.
 * retval kStatus_Success Successfully complete the data transmission.
 * retval kStatus_I2C_ArbitrationLost Transfer error, arbitration lost.
 * retval kStataus_I2C_Nak Transfer error, receive NAK during transfer.
 * retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 */
status_t I2C_SlaveWriteBlocking(I2C_Type *base, const uint8_t *pu8TxBuff, uint16_t txSize)
{
    status_t result = kStatus_Success;

#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    /* Check start flag. */
    while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_StartDetectInterruptFlag))
    {
    }
    /* Clear the start detect and interrupt flag. */
    I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_StartDetectInterruptFlag | (uint16_t)kI2C_InterruptPendingFlag);
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */

