nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
#if I2C_RETRY_TIMES
    uint32_t u32WaitTimes = I2C_RETRY_TIMES;
    /* Slave only transfer data when it is addressed by master. */
    while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_AddressAsSlaveInterruptFlag)) &&
           (0U != --u32WaitTimes))
    {
    }
    if (0U == u32WaitTimes)
    {
        return kStatus_I2C_Timeout;
    }
#else
    /* Slave only transfer data when it is addressed by master. */
    while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_AddressAsSlaveInterruptFlag))
    {
    }
#endif
    /* Read dummy to release bus. */
    (void)I2C_ReadByte(base);

    /* Send data to master, re-use I2C_MasterWriteBlocking with the send stop flag set to false. */
    result = I2C_MasterWriteBlocking(base, pu8TxBuff, txSize, false);

    /* Switch to receive mode at the end of the transfer. */
    I2C_SetTransferDirection(base, kI2C_Read);

    /* Read dummy to release bus. */
    (void)I2C_ReadByte(base);

    return result;
}

/*!
 * brief Receives a piece of data from I2C bus in slave mode in blocking way.
 *
 * Call this funtion to let I2C slave poll register status until it is addressed, then slave receives rxSize of data
 * until all the data has been received.
 *
 * param base I2C base pointer.
 * param pu8RxBuff The pointer to the data to store the received data.
 * param rxSize The length in bytes of the data to be received.
 * retval kStatus_Success Successfully complete data receive.
 * retval kStatus_I2C_Timeout Wait status flag timeout.
 */
status_t I2C_SlaveReadBlocking(I2C_Type *base, uint8_t *pu8RxBuff, uint16_t rxSize)
{
    status_t result = kStatus_Success;

#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    /* Check start flag. */
    while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_StartDetectInterruptFlag))
    {
    }
    /* Clear start detect flag and interrupt pending flag. */
    I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_StartDetectInterruptFlag | (uint16_t)kI2C_InterruptPendingFlag);
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */

#if I2C_RETRY_TIMES
    uint32_t u32WaitTimes = I2C_RETRY_TIMES;
    /* Slave only transfer data when it is addressed by master. */
    while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_AddressAsSlaveInterruptFlag)) &&
           (0U != --u32WaitTimes))
    {
    }
    if (0U == u32WaitTimes)
    {
        return kStatus_I2C_Timeout;
    }

    u32WaitTimes = I2C_RETRY_TIMES;
    while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag)) && (0U != --u32WaitTimes))
    {
    }
    if (0U == u32WaitTimes)
    {
        return kStatus_I2C_Timeout;
    }
#else
    /* Slave only transfer data when it is addressed by master. */
    while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_AddressAsSlaveInterruptFlag))
    {
    }
    while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag))
    {
    }
#endif

    /* Read dummy to release bus. */
    (void)I2C_ReadByte(base);

    /* Clear the IICIF flag. */
    I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

    /* Setup the I2C peripheral to receive data. */
    I2C_SetTransferDirection(base, kI2C_Read);

    while (0U != (rxSize--))
    {
#if I2C_RETRY_TIMES
        u32WaitTimes = I2C_RETRY_TIMES;
        /* Wait until data transfer complete. */
        while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        /* Wait until data transfer complete. */
        while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag))
        {
        }
#endif
        /* Clear the IICIF flag. */
        I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

        /* Read from the data register. */
        *pu8RxBuff++ = I2C_ReadByte(base);
    }

    return result;
}
/* ----------------------------------------- End of Bus Operation Sub-group ----------------------------------------- */

/* ========================================== Transactional Group API List ========================================== */
/* ------------------------------------------- Master Transfer Sub-group -------------------------------------------- */
/*!
 * brief Performs a master polling transfer on the I2C bus.
 *
 * note The API does not return until the transfer succeeds or fails due to arbitration lost or receiving a NAK or PEC
 * error.
 *
 * param base I2C peripheral base address.
 * param psTransferConfig Pointer to the transfer configuration structure.
 * retval kStatus_Success Successfully complete the data transmission.
 * retval #kStatus_I2C_Busy Previous transmission still not finished.
 * retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 * retval #kStatus_I2C_ArbitrationLost Transfer error, arbitration lost.
 * retval #kStataus_I2C_Nak Transfer error, receive NAK during transfer.
 */
status_t I2C_MasterTransferBlocking(I2C_Type *base, i2c_master_transfer_t *psTransferConfig)
{
    assert(NULL != psTransferConfig);

    i2c_master_transfer_direction_t eDirection = psTransferConfig->eDirection;
    status_t result                            = kStatus_Success;

    I2C_Enable(base, true);
    /* Clear all status before transfer. */
    I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_StatusAllFlags);

#if I2C_RETRY_TIMES
    uint32_t u32WaitTimes = I2C_RETRY_TIMES;
    /* Wait until the data register is ready for transmit. */
    while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_ByteTransferCompleteInterruptFlag)) &&
           (0U != --u32WaitTimes))
    {
    }
    if (0U == u32WaitTimes)
    {
        return kStatus_I2C_Timeout;
    }
#else
    /* Wait until the data register is ready for transmit. */
    while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_ByteTransferCompleteInterruptFlag))
    {
    }
#endif

    /* Change direction to write if it's a master receive operation with command code. */
    if ((psTransferConfig->u8CommandSize > 0U) && (psTransferConfig->eDirection == kI2C_MasterReceive))
    {
        eDirection = kI2C_MasterTransmit;
    }

