nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
    /* Handle transfer with no start signal, according to I2C protocol, only support write with no start signal. */
    if (0U != (psTransferConfig->u8ControlFlagMask & (uint8_t)kI2C_TransferNoStartFlag))
    {
        if (eDirection == kI2C_MasterReceive)
        {
            return kStatus_InvalidArgument;
        }
    }
    /* If repeated start is requested, send repeated start. */
    else if (0U != (psTransferConfig->u8ControlFlagMask & (uint8_t)kI2C_TransferRepeatedStartFlag))
    {
        result = I2C_MasterRepeatedStart(base, psTransferConfig->u8SlaveAddress, eDirection);
    }
    else /* For normal transfer, send start. */
    {
        result = I2C_MasterStart(base, psTransferConfig->u8SlaveAddress, eDirection);
    }

    /* If start signal and slave address was sent, check bus status to see if master is nacked or lost arbitration. */
    if (0U == (psTransferConfig->u8ControlFlagMask & (uint8_t)kI2C_TransferNoStartFlag))
    {
        /* Return if error. */
        if (kStatus_Success != result)
        {
            return result;
        }

#if I2C_RETRY_TIMES
        u32WaitTimes = I2C_RETRY_TIMES;
        /* Wait until data transfer complete. */
        while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        /* Wait until data transfer complete. */
        while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag))
        {
        }
#endif
        /* Check if there's transfer error. */
        result = I2C_MasterCheckAndClearError(base, I2C_MasterGetStatusFlags(base));

        /* Return if error. */
        if (kStatus_Success != result)
        {
            if (result == kStatus_I2C_Nak)
            {
                result = kStatus_I2C_Addr_Nak;

                (void)I2C_MasterStop(base);
            }

            return result;
        }
    }

    /* Send command. */
    if (0U != (psTransferConfig->u8CommandSize))
    {
#if I2C_SMBUS_ENABLE
        I2C_UpdateCrc8(&s_u8MasterCrcValue, psTransferConfig->pu8Command, psTransferConfig->u8CommandSize);
#endif
        do
        {
            /* Clear interrupt pending flag. */
            I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

            psTransferConfig->u8CommandSize--;
            I2C_WriteByte(base, *psTransferConfig->pu8Command++);

#if I2C_RETRY_TIMES
            u32WaitTimes = I2C_RETRY_TIMES;
            /* Wait until data transfer complete. */
            while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag)) &&
                   (0U != --u32WaitTimes))
            {
            }
            if (0U == u32WaitTimes)
            {
                return kStatus_I2C_Timeout;
            }
#else
            /* Wait until data transfer complete. */
            while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag))
            {
            }
#endif

            /* Check if there's transfer error. */
            result = I2C_MasterCheckAndClearError(base, I2C_MasterGetStatusFlags(base));

            if (0 != result)
            {
                if (result == kStatus_I2C_Nak)
                {
                    (void)I2C_MasterStop(base);
                }

                return result;
            }

        } while (psTransferConfig->u8CommandSize > 0U);

        /* If it is master read operation, issue repeated start is required. */
        if (psTransferConfig->eDirection == kI2C_MasterReceive)
        {
            /* Clear pending flag. */
            I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

            /* Send repeated start and slave address. */
            result = I2C_MasterRepeatedStart(base, psTransferConfig->u8SlaveAddress, kI2C_MasterReceive);

            /* Return if error. */
            if (kStatus_Success != result)
            {
                return result;
            }

#if I2C_RETRY_TIMES
            u32WaitTimes = I2C_RETRY_TIMES;
            /* Wait until data transfer complete. */
            while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag)) &&
                   (0U != --u32WaitTimes))
            {
            }
            if (0U == u32WaitTimes)
            {
                return kStatus_I2C_Timeout;
            }
#else
            /* Wait until data transfer complete. */
            while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_InterruptPendingFlag))
            {
            }
#endif

            /* Check if master is nacked by slave or lost arbitration. */
            result = I2C_MasterCheckAndClearError(base, I2C_MasterGetStatusFlags(base));

            if (kStatus_Success != result)
            {
                if (result == kStatus_I2C_Nak)
                {
                    result = kStatus_I2C_Addr_Nak;

                    (void)I2C_MasterStop(base);
                }

                return result;
            }
        }
    }

    /* Transmit data. */
    if (psTransferConfig->eDirection == kI2C_MasterTransmit)
    {
        if (psTransferConfig->u16DataSize > 0U)
        {
            uint8_t *u8Tmpdata     = psTransferConfig->pu8Data;
            uint16_t u8TmpdataSize = psTransferConfig->u16DataSize;
            bool bSendStop         = ((psTransferConfig->u8ControlFlagMask & (uint8_t)kI2C_TransferNoStopFlag) == 0U);
            /* Send Data. */
            result = I2C_MasterWriteBlocking(base, u8Tmpdata, u8TmpdataSize, bSendStop);
        }
        else if (0U == (psTransferConfig->u8ControlFlagMask & (uint8_t)kI2C_TransferNoStopFlag))
        {
            /* Send stop. */
            result = I2C_MasterStop(base);
        }
        else
        {
            /* Add this to fix MISRA C2012 rule15.7 issue: Empty else without comment. */
        }
    }

    /* Receive Data. */
    if ((psTransferConfig->u16DataSize > 0U) && (psTransferConfig->eDirection == kI2C_MasterReceive))
    {
        uint8_t *u8Tmpdata     = psTransferConfig->pu8Data;
        uint16_t u8TmpdataSize = psTransferConfig->u16DataSize;
        bool bSendStop         = ((psTransferConfig->u8ControlFlagMask & (uint8_t)kI2C_TransferNoStopFlag) == 0U);
        result                 = I2C_MasterReadBlocking(base, u8Tmpdata, u8TmpdataSize, bSendStop);
    }

    return result;
}

/*!
 * brief Initializes the I2C master transfer in interrupt way.
 *
 * This function is responsible for initializig master transfer handle, installing user Callback, registering master
 * IRQ handling function and opening global interrupt.
 *
 * param base I2C base pointer.
 * param psHandle pointer to i2c_master_transfer_handle_t structure to store the transfer state.
 * param pfCallback pointer to user pfCallback function.
 * param pUserData User configurable pointer to any data, function, structure etc that user wish to use in the callback
 */
void I2C_MasterTransferCreateHandle(I2C_Type *base,
                                    i2c_master_transfer_handle_t *psHandle,
                                    i2c_master_transfer_callback_t pfCallback,
                                    void *pUserData)
{
    assert(NULL != psHandle);

