nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
    uint32_t instance = I2C_GetInstance(base);

    /* Zero handle. */
    (void)memset(psHandle, 0, sizeof(*psHandle));

    /* Register pfCallback and pUserData. */
    psHandle->pfCompletionCallback = pfCallback;
    psHandle->pUserData            = pUserData;
    psHandle->base                 = base;
    psHandle->u8State              = kMasterIdleState;

    /* Save the context in global variables to support the double weak mechanism. */
    s_pI2cHandles[instance] = psHandle;

    /* Register master interrupt service routine. */
    s_pfI2cMasterIsr = I2C_MasterTransferHandleIRQ;

    /* Enable I2C global IRQ. */
    (void)EnableIRQ(s_eI2cIrqs[instance]);
}

/*!
 * brief Initiates a master transfer on the I2C bus in interrupt way.
 *
 * note Transfer in interrupt way is non-blocking which means this API returns immediately after transfer initiates.
 * User can call @ref I2C_MasterTransferGetCount to get the count of data that master has transmitted/received and check
 * transfer status. If the return status is kStatus_NoTransferInProgress, the transfer is finished. Also if user
 * installs a user pfCallback when calling @ref I2C_MasterTransferCreateHandle before, the pfCallback will be invoked
 * when transfer finishes.
 *
 * param psHandle pointer to i2c_master_transfer_handle_t structure which stores the transfer state.
 * param psTransferConfig Pointer to the transfer configuration structure.
 * retval kStatus_Success Successfully start the data transmission.
 * retval #kStatus_I2C_Busy Previous transmission still not finished.
 * retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flagsto change.
 */
status_t I2C_MasterTransferNonBlocking(i2c_master_transfer_handle_t *psHandle, i2c_master_transfer_t *psTransferConfig)
{
    assert(NULL != psHandle);
    assert(NULL != psTransferConfig);

    status_t result = kStatus_Success;

    /* Check if the I2C bus is idle, if not return busy status. */
    if (psHandle->u8State != (uint8_t)kMasterIdleState)
    {
        result = kStatus_I2C_Busy;
    }
    else
    {
        /* Enable module */
        I2C_Enable(psHandle->base, true);
        /* Initialize the driver's master software transfer state machine. */
        result = I2C_MasterTransferInitStateMachine(psHandle, psTransferConfig);
#if I2C_SMBUS_ENABLE
        s_bIsMaster = true;
#endif /* I2C_SMBUS_ENABLE */

        if (result == kStatus_Success)
        {
            /* Enable the I2C interrupts. */
            I2C_EnableInterrupts(psHandle->base, (uint16_t)kI2C_GlobalInterruptEnable);
        }
    }

    return result;
}

/*!
 * brief Gets the master transfer count and status during a interrupt transfer.
 *
 * param psHandle pointer to i2c_master_transfer_handle_t structure which stores the transfer state.
 * param count Pointer to number of bytes transferred so far by the non-blocking transaction.
 * retval kStatus_InvalidArgument count is Invalid.
 * retval kStatus_NoTransferInProgress Curent no transfer is in progress.
 * retval kStatus_Success Successfully obtained the count.
 */
status_t I2C_MasterTransferGetCount(i2c_master_transfer_handle_t *psHandle, uint16_t *count)
{
    assert(NULL != psHandle);

    if (NULL == count)
    {
        return kStatus_InvalidArgument;
    }

    /* Catch when there is not an active transfer. */
    if (psHandle->u8State == (uint8_t)kMasterIdleState)
    {
        return kStatus_NoTransferInProgress;
    }

    /* Calculate transfer count. */
    *count = psHandle->u16TransferSize - psHandle->sTransfer.u16DataSize;

    return kStatus_Success;
}

/*!
 * brief Aborts an in-process transfer in interrupt way.
 *
 * note This API can be called at any time after a transfer of interrupt way initiates and before it finishes to abort
 * the transfer early.
 *
 * param psHandle pointer to i2c_master_transfer_handle_t structure which stores the transfer state
 * retval #kStatus_I2C_Busy Master lost arbitration, bus is in use by other master.
 * retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 * retval kStatus_Success Successfully abort the transfer.
 */
status_t I2C_MasterTransferAbort(i2c_master_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);
    status_t result = kStatus_Success;

#if I2C_RETRY_TIMES
    uint32_t u32WaitTimes = I2C_RETRY_TIMES;
#endif

    /* Disable interrupt. */
    I2C_DisableInterrupts(psHandle->base, (uint16_t)kI2C_GlobalInterruptEnable);

    /* Reset the state to idle. */
    psHandle->u8State = (uint8_t)kMasterIdleState;

    /* If the bus is already in use, but not by us */
    if (false == I2C_IsMaster(psHandle->base))
    {
        return kStatus_I2C_Busy;
    }

    /* Send STOP signal. */
    if (psHandle->sTransfer.eDirection == kI2C_MasterReceive)
    {
        I2C_SendAck(psHandle->base, false);

#if I2C_RETRY_TIMES
        /* Wait until data transfer complete. */
        while ((0U == (I2C_MasterGetStatusFlags(psHandle->base) & (uint16_t)kI2C_InterruptPendingFlag)) &&
               (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        /* Wait until data transfer complete. */
        while (0U == (I2C_MasterGetStatusFlags(psHandle->base) & (uint16_t)kI2C_InterruptPendingFlag))
        {
        }
#endif
        I2C_MasterClearStatusFlags(psHandle->base, (uint16_t)kI2C_InterruptPendingFlag);

        result = I2C_MasterStop(psHandle->base);
        /* Do dummy read */
        (void)I2C_ReadByte(psHandle->base);
    }
    else
    {
#if I2C_RETRY_TIMES
        /* Wait until data transfer complete. */
        while ((0U == (I2C_MasterGetStatusFlags(psHandle->base) & (uint16_t)kI2C_InterruptPendingFlag)) &&
               (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        /* Wait until data transfer complete. */
        while (0U == (I2C_MasterGetStatusFlags(psHandle->base) & (uint16_t)kI2C_InterruptPendingFlag))
        {
        }
#endif
        I2C_MasterClearStatusFlags(psHandle->base, (uint16_t)kI2C_InterruptPendingFlag);
        result = I2C_MasterStop(psHandle->base);
    }
    /* Disable module */
    I2C_Enable(psHandle->base, false);
#if I2C_SMBUS_ENABLE
    s_bIsMaster = false;
#endif /* I2C_SMBUS_ENABLE */
    return result;
}
/* ---------------------------------------- End of Master Transfer Sub-group ---------------------------------------- */

/* ------------------------------------------- Slave Transfer Sub-group --------------------------------------------- */
/*!
 * brief Initializes the I2C slave transfer in interrupt way.
 *
 * This function is responsible for initializig slave transfer handle, installing user callback, registering slave IRQ
 * handling function and opening global interrupt.
 *
 * param base I2C base pointer.
 * param psHandle pointer to i2c_slave_transfer_handle_t structure to store the transfer state.
 * param pfCallback pointer to user pfCallback function.
 * param pUserData User configurable pointer to any data, function, structure etc that user wish to use in the callback
 */
void I2C_SlaveTransferCreateHandle(I2C_Type *base,
                                   i2c_slave_transfer_handle_t *psHandle,
                                   i2c_slave_transfer_callback_t pfCallback,
                                   void *pUserData)
{
    assert(NULL != psHandle);

