nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
    uint32_t instance = I2C_GetInstance(base);

    /* Zero handle. */
    (void)memset(psHandle, 0, sizeof(*psHandle));

    /* Register pfCallback and pUserData. */
    psHandle->pfCallback = pfCallback;
    psHandle->pUserData  = pUserData;
    psHandle->base       = base;
    psHandle->u8State    = kSlaveTurnedOffState;
    /* Save the context in global variables to support the double weak mechanism. */
    s_pI2cHandles[instance] = psHandle;

    /* Register slave interrupt service routine. */
    s_pfI2cSlaveIsr = I2C_SlaveTransferHandleIRQ;

    /* Enable I2C global IRQ. */
    (void)EnableIRQ(s_eI2cIrqs[instance]);
}

/*!
 * brief Sets I2C slave ready to process bus events.
 *
 * Call this API to let I2C start monitoring bus events driven by I2C master on bus. When user specified event occurs,
 * callback will be invoked passes event information to the callback.
 *
 * note When #kI2C_SlaveOutofTransmitDataEvent and #kI2C_SlaveOutofReceiveSpaceEvent occured, slave callback will
 * always be revoked regardless which events user choose to enable. This means user need not configure them in the
 * psTransferConfig. If user wants to enable all the events, use #kI2C_SlaveAllEvents for convenience.
 *
 * param psHandle Pointer to #i2c_slave_transfer_handle_t structure which stores the transfer state.
 * param psTransferConfig I2C transfer configuration.
 * retval kStatus_Success I2C slave set to standby state successfully and ready to process events.
 * retval kStatus_I2C_Busy I2C slave has already been started on this handle.
 */
status_t I2C_SlaveTransferNonBlocking(i2c_slave_transfer_handle_t *psHandle, i2c_slave_transfer_t *psTransferConfig)
{
    assert(NULL != psHandle);
    /* Transactional layer does not support slave 10-bit address. */
    assert((psHandle->base->C2 & I2C_C2_ADEXT_MASK) == 0U);

    /* Check if I2C bus is already in an active transfer. */
    if (kSlaveBusyState == psHandle->u8State)
    {
        return kStatus_I2C_Busy;
    }
    else
    {
        I2C_Enable(psHandle->base, true);
        /* Disable I2C IRQ sources when configuring. */
        I2C_DisableInterrupts(psHandle->base, (uint16_t)kI2C_AllInterruptEnable);

        /* Zero transfer in handle. */
        (void)memset(&psHandle->sTransfer, 0, sizeof(psHandle->sTransfer));
        /* Initialize the handle's transfer information. */
        /* Set up event mask. tx and rx are always enabled. */
        psHandle->sTransfer.u8EventMask = psTransferConfig->u8EventMask | (uint8_t)kI2C_SlaveOutofTransmitDataEvent |
                                          (uint8_t)kI2C_SlaveOutofReceiveSpaceEvent;
        psHandle->sTransfer.pu8Data     = psTransferConfig->pu8Data;
        psHandle->sTransfer.u16DataSize = psTransferConfig->u16DataSize;

        /* Change to idle state to indicate this I2C slave is ready to monitor and process bus events. */
        psHandle->u8State = kSlaveIdleState;

        /* Clear all status flags. */
        I2C_SlaveClearStatusFlags(psHandle->base, (uint16_t)kI2C_StatusAllFlags);

#if I2C_SMBUS_ENABLE
        s_bIsMaster = false;
#endif /* I2C_SMBUS_ENABLE */

        /* Enable I2C internal IRQ sources. */
        I2C_EnableInterrupts(psHandle->base, (uint16_t)kI2C_AllInterruptEnable);
    }

    return kStatus_Success;
}

/*!
 * brief Gets how many bytes slave have transferred after the last start/repeated start signal.
 *
 * param psHandle pointer to i2c_slave_transfer_handle_t structure.
 * param count Number of bytes slave have transferred after the last start/repeated start.
 * retval kStatus_InvalidArgument count is Invalid.
 * retval kStatus_NoTransferInProgress Curent no transfer is in progress.
 * retval kStatus_Success Successfully obtained the count.
 */
status_t I2C_SlaveTransferGetCount(i2c_slave_transfer_handle_t *psHandle, uint16_t *count)
{
    assert(NULL != psHandle);

    if (NULL == count)
    {
        return kStatus_InvalidArgument;
    }

    /* Check whether I2C bus is in active transfer, that is whether start signal is detected. */
    if (kSlaveBusyState != psHandle->u8State)
    {
        *count = 0;
        return kStatus_NoTransferInProgress;
    }

    /* Calculate transfer count. */
    *count = psHandle->u16TransferredCount;

    return kStatus_Success;
}

/*!
 * brief Aborts the slave transfer.
 *
 * note This API can be called at any time to stop slave for handling further bus events.
 *
 * param psHandle pointer to i2c_slave_transfer_handle_t structure which stores the transfer state.
 */
void I2C_SlaveTransferAbort(i2c_slave_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    /* If this I2C instance has not been set up to process I2C event, no need to abort transfer, */
    if (kSlaveTurnedOffState != psHandle->u8State)
    {
        /* Disable interrupts. */
        I2C_DisableInterrupts(psHandle->base, (uint16_t)kI2C_AllInterruptEnable);

        /* Zero transfer infomation in handle. */
        (void)memset(&psHandle->sTransfer, 0, sizeof(psHandle->sTransfer));

        /* Reset the state to turned off. */
        psHandle->u8State = kSlaveTurnedOffState;

        /* Disable module */
        I2C_Enable(psHandle->base, false);
    }
}
/* ---------------------------------------- End of SLave Transfer Sub-group ----------------------------------------- */
/* ========================================= End of Transactional API Group ========================================= */

/* ============================================ Driver Internal Functions =========================================== */
static void I2C_SetHoldTime(I2C_Type *base, uint32_t u32SclStopHoldTime_ns, uint32_t u32SourceClock_Hz)
{
    uint32_t u32Multiplier;
    uint32_t u32ComputedSclHoldTime;
    uint32_t u32AbsError;
    uint32_t u32BestError = UINT32_MAX;
    uint32_t u32BestMult  = 0u;
    uint32_t u32BestIcr   = 0u;
    uint32_t u32Flag      = 1u;
    uint8_t u8Mult;
    uint8_t i;

    /* Search for the settings with the lowest error. Mult is the MULT field of the I2C_F register,
     * and ranges from 0-2. It selects the u32Multiplier factor for the divider. */
    /* SDA hold time = bus period (s) * mul * SDA hold value. */
    /* SCL start hold time = bus period (s) * mul * SCL start hold value. */
    /* SCL stop hold time = bus period (s) * mul * SCL stop hold value. */

    for (u8Mult = 0u; u8Mult <= 2u; ++u8Mult)
    {
        if (u32BestError == 0u)
        {
            break;
        }

