nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
        u32Multiplier = u32Flag << u8Mult;

        /* Scan table to find best match. */
        for (i = 0u; i < sizeof(s_u16I2cDividerTable) / sizeof(s_u16I2cDividerTable[0]); ++i)
        {
            /* Assume SCL hold(stop) value = s_u16I2cDividerTable[i]/2. */
            u32ComputedSclHoldTime =
                ((u32Multiplier * s_u16I2cDividerTable[i]) * 500000U) / (u32SourceClock_Hz / 1000U);
            u32AbsError = u32SclStopHoldTime_ns > u32ComputedSclHoldTime ?
                              (u32SclStopHoldTime_ns - u32ComputedSclHoldTime) :
                              (u32ComputedSclHoldTime - u32SclStopHoldTime_ns);

            if (u32AbsError < u32BestError)
            {
                u32BestMult  = u8Mult;
                u32BestIcr   = i;
                u32BestError = u32AbsError;

                /* If the error is 0, then we can stop searching because we won't find a better match. */
                if (u32AbsError == 0u)
                {
                    break;
                }
            }
        }
    }

    /* Set frequency register based on best settings. */
    base->F = I2C_F_MULT(u32BestMult) | I2C_F_ICR(u32BestIcr);
}

static status_t I2C_MasterCheckAndClearError(I2C_Type *base, uint16_t u16Status)
{
    status_t result = kStatus_Success;

    /* Check arbitration lost. */
    if (0U != (u16Status & (uint16_t)kI2C_ArbitrationLostInterruptFlag))
    {
        /* Clear arbitration lost flag. */
        I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_ArbitrationLostInterruptFlag);
        result = kStatus_I2C_ArbitrationLost;
    }
    /* Check NAK */
    else if (0U != (u16Status & (uint16_t)kI2C_ReceiveNakFlag))
    {
        result = kStatus_I2C_Nak;
    }
    else
    {
        /* Add this to fix MISRA C2012 rule15.7 issue: Empty else without comment. */
    }

    return result;
}

static status_t I2C_MasterTransferInitStateMachine(i2c_master_transfer_handle_t *psHandle,
                                                   i2c_master_transfer_t *psTransferConfig)
{
    I2C_Type *base                            = psHandle->base;
    status_t result                           = kStatus_Success;
    i2c_master_transfer_direction_t direction = psTransferConfig->eDirection;

    /* Initialize the handle transfer information. */
    psHandle->sTransfer = *psTransferConfig;

    /* Save total transfer size. */
    psHandle->u16TransferSize = psTransferConfig->u16DataSize;

    /* Set transfer direction to write if there is command. */
    if (psHandle->sTransfer.u8CommandSize > 0u)
    {
        if (psTransferConfig->eDirection == kI2C_MasterReceive)
        {
            direction = kI2C_MasterTransmit;
        }
    }

    /* Initialize transfer state. */
    psHandle->u8State = (uint8_t)kMasterCheckAddressState;

    /* Clear all status before transfer. */
    I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_StatusAllFlags);

    /* Handle no start option. */
    if (0U != (psHandle->sTransfer.u8ControlFlagMask & (uint8_t)kI2C_TransferNoStartFlag))
    {
        /* No need to send start flag, go to send command or data phase directly. */
        if (psHandle->sTransfer.u8CommandSize > 0u)
        {
            psHandle->u8State = (uint8_t)kMasterSendCommandState;
        }
        else
        {
            if (direction == kI2C_MasterTransmit)
            {
                /* Next state, send data. */
                psHandle->u8State = (uint8_t)kMasterSendDataState;
            }
            else
            {
                /* According to I2C protocol, do not read with no start signal. */
                return kStatus_InvalidArgument;
            }
        }

        /* Wait for transfer complete bit and manually trigger tx interrupt. */
#if I2C_RETRY_TIMES
        uint32_t u32WaitTimes = I2C_RETRY_TIMES;
        while ((0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_ByteTransferCompleteInterruptFlag)) &&
               (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_I2C_Timeout;
        }
#else
        while (0U == (I2C_MasterGetStatusFlags(base) & (uint16_t)kI2C_ByteTransferCompleteInterruptFlag))
        {
        }
#endif
        I2C_MasterTransferHandleIRQ(psHandle);
    }
    /* If repeated start is requested, send repeated start. */
    else if (0U != (psHandle->sTransfer.u8ControlFlagMask & (uint8_t)kI2C_TransferRepeatedStartFlag))
    {
        result = I2C_MasterRepeatedStart(base, psHandle->sTransfer.u8SlaveAddress, direction);
    }
    else /* For normal transfer, send start. */
    {
        result = I2C_MasterStart(base, psHandle->sTransfer.u8SlaveAddress, direction);
    }

    return result;
}

static status_t I2C_MasterTransferRunStateMachine(i2c_master_transfer_handle_t *psHandle, bool *bIsDone)
{
    uint8_t u8Tmpdata;
    I2C_Type *base  = psHandle->base;
    *bIsDone        = false;
    bool bSendStop  = ((psHandle->sTransfer.u8ControlFlagMask & (uint8_t)kI2C_TransferNoStopFlag) == 0U);
    status_t result = I2C_MasterCheckAndClearError(base, I2C_MasterGetStatusFlags(base));
#if (!I2C_SMBUS_ENABLE)
    uint16_t u16TmpdataSize = psHandle->sTransfer.u16DataSize;
    bool bIgnoreNak         = ((psHandle->u8State == (uint8_t)kMasterSendDataState) && (u16TmpdataSize == 0U)) ||
                      ((psHandle->u8State == (uint8_t)kMasterReceiveDataState) && (u16TmpdataSize == 1U));
    /* Check & clear error flags. */
    /* Ignore Nak when it's for the last byte. */
    if ((result == kStatus_I2C_Nak) && bIgnoreNak)
    {
        result = kStatus_Success;
    }
#endif

    /* Handle Check address state to check whether the slave address is nacked during slave probing. */
    if (psHandle->u8State == (uint8_t)kMasterCheckAddressState)
    {
        if (result == kStatus_I2C_Nak)
        {
            result = kStatus_I2C_Addr_Nak;
        }
        else
        {
            /* Next state, send command. */
            if (psHandle->sTransfer.u8CommandSize > 0U)
            {
                psHandle->u8State = (uint8_t)kMasterSendCommandState;
            }
            else
            {
                if (psHandle->sTransfer.eDirection == kI2C_MasterTransmit)
                {
                    /* Next state, send data. */
                    psHandle->u8State = (uint8_t)kMasterSendDataState;
                }
                else
                {
                    /* Next state, receive data begin. */
                    psHandle->u8State = (uint8_t)kMasterReceiveDataBeginState;
                }
            }
        }
    }

