nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
#if I2C_SMBUS_ENABLE
    if ((kStatus_Success != result) & (psHandle->u8State != (uint8_t)kMasterCheckSentPecResponseState))
#else
    if (kStatus_Success != result)
#endif /* I2C_SMBUS_ENABLE */
    {
        return result;
    }

    /* Run state machine. */
    switch (psHandle->u8State)
    {
        /* Send I2C command. */
        case (uint8_t)kMasterSendCommandState:
            if (0U != (psHandle->sTransfer.u8CommandSize))
            {
                psHandle->sTransfer.u8CommandSize--;
#if I2C_SMBUS_ENABLE
                I2C_UpdateCrc8(&s_u8MasterCrcValue, psHandle->sTransfer.pu8Command, 1U);
#endif /* I2C_SMBUS_ENABLE */
                /* Send I2C command byte by byte. */
                I2C_WriteByte(base, *psHandle->sTransfer.pu8Command++);
            }
            else
            {
                if (psHandle->sTransfer.eDirection == kI2C_MasterTransmit)
                {
                    /* Send first byte of data. */
                    if (psHandle->sTransfer.u16DataSize > 0U)
                    {
                        /* Next state, send data. */
                        psHandle->u8State = (uint8_t)kMasterSendDataState;
#if I2C_SMBUS_ENABLE
                        I2C_UpdateCrc8(&s_u8MasterCrcValue, psHandle->sTransfer.pu8Data, 1U);
#endif /* I2C_SMBUS_ENABLE */
                        I2C_WriteByte(base, *psHandle->sTransfer.pu8Data);
                        psHandle->sTransfer.pu8Data++;
                        psHandle->sTransfer.u16DataSize--;
                    }
                    else
                    {
#if I2C_SMBUS_ENABLE
                        if (bSendStop)
                        {
                            /* Send calculated PEC. */
                            I2C_WriteByte(base, s_u8MasterCrcValue);
                            /* Next state, check how slave response to PEC byte. */
                            psHandle->u8State = (uint8_t)kMasterCheckSentPecResponseState;
                        }
#else  /* I2C_SMBUS_ENABLE */
                        /* When data size is zero, transfer is done. */
                        *bIsDone = true;
#endif /* I2C_SMBUS_ENABLE */
                    }
                }
                else
                {
                    /* Send repeated start and slave address. */
                    result = I2C_MasterRepeatedStart(base, psHandle->sTransfer.u8SlaveAddress, kI2C_MasterReceive);
                    /* Next state, receive data begin. */
                    psHandle->u8State = (uint8_t)kMasterReceiveDataBeginState;
                }
            }
            break;

        /* Send I2C data. */
        case (uint8_t)kMasterSendDataState:
            /* Send one byte of data. */
            if (psHandle->sTransfer.u16DataSize > 0U)
            {
#if I2C_SMBUS_ENABLE
                I2C_UpdateCrc8(&s_u8MasterCrcValue, psHandle->sTransfer.pu8Data, 1U);
#endif /* I2C_SMBUS_ENABLE */
                I2C_WriteByte(base, *psHandle->sTransfer.pu8Data);
                psHandle->sTransfer.pu8Data++;
                psHandle->sTransfer.u16DataSize--;
            }
            else
            {
#if I2C_SMBUS_ENABLE
                if (bSendStop)
                {
                    /* Send calculated PEC. */
                    I2C_WriteByte(base, s_u8MasterCrcValue);
                    /* Next state, check how slave response to PEC byte. */
                    psHandle->u8State = (uint8_t)kMasterCheckSentPecResponseState;
                }
                else
                {
#endif /* I2C_SMBUS_ENABLE */
                    /* When data size is zero, transfer is done. */
                    *bIsDone = true;
#if I2C_SMBUS_ENABLE
                }
#endif /* I2C_SMBUS_ENABLE */
            }
            break;

#if I2C_SMBUS_ENABLE
        case (uint8_t)kMasterCheckSentPecResponseState:
            if (kStatus_I2C_Nak == result)
            {
                result = kStatus_I2C_Pec_Error;
            }
            else
            {
                /* Transfer done after checking PEC */
                *bIsDone = true;
            }
            break;
#endif /* I2C_SMBUS_ENABLE */

        /* Start I2C data receive. This state is used to check if the transfer size is 1 if not using SMBus mode.
           If so, the nack signal should be issued before receiving the last byte. */
        case (uint8_t)kMasterReceiveDataBeginState:

#if I2C_MASTER_FACK_CONTROL
            I2C_EnableFastAck(base, true);
#endif /* I2C_MASTER_FACK_CONTROL */
            /* Setup the I2C peripheral to receive data. */
            I2C_SetTransferDirection(base, kI2C_Read);

            /* Do dummy read to release the bus. */
            (void)I2C_ReadByte(base);

#if (!I2C_SMBUS_ENABLE)
            if (psHandle->sTransfer.u16DataSize == 1U)
            {
                /* Send an non-acknowledge signal to the bus on the following receiving byte. */
                I2C_SendAck(base, false);
#if I2C_MASTER_FACK_CONTROL
                /* Disable fast ACK for the last receving byte. */
                I2C_EnableFastAck(base, false);
#endif /* I2C_MASTER_FACK_CONTROL */
            }
#endif /* I2C_SMBUS_ENABLE */

            /* Next state, receive data. */
            psHandle->u8State = (uint8_t)kMasterReceiveDataState;
            break;

        /* Receive I2C data. */
        case (uint8_t)kMasterReceiveDataState:

            /* Receive one byte of data. */
            if (0U != (psHandle->sTransfer.u16DataSize--))
            {
                if (psHandle->sTransfer.u16DataSize == 0U)
                {
                    /* Only check received PEC when stop signal should be issued. */
                    if (bSendStop)
                    {
#if (!I2C_SMBUS_ENABLE)
                        result   = I2C_MasterStop(base);
                        *bIsDone = true;
#endif /* I2C_SMBUS_ENABLE */
                    }
                    else /* Otherwise curent process is done. */
                    {
                        I2C_SetTransferDirection(base, kI2C_Write);
                        *bIsDone = true;
                    }
                }

                /* Read the data byte into the transfer buffer. */
                u8Tmpdata                    = I2C_ReadByte(base);
                *psHandle->sTransfer.pu8Data = u8Tmpdata;
                psHandle->sTransfer.pu8Data++;
#if I2C_SMBUS_ENABLE
                I2C_UpdateCrc8(&s_u8MasterCrcValue, &u8Tmpdata, 1U);
                if ((psHandle->sTransfer.u16DataSize == 0U) && (bSendStop))
                {
                    I2C_SendAck(base, false);
                    psHandle->u8State = (uint8_t)kMasterCheckReceivedPecState;
                }
#else /* I2C_SMBUS_ENABLE */
#if I2C_MASTER_FACK_CONTROL
                if (psHandle->sTransfer.u16DataSize != 0U)
                {
                    I2C_AckByte(base, true);
                }
#endif
                if (psHandle->sTransfer.u16DataSize == 1U)
                {
                    /* Issue NACK on read. */
                    I2C_SendAck(base, false);
#if I2C_MASTER_FACK_CONTROL
                    I2C_EnableFastAck(base, false);
#endif
                }
#endif /* I2C_SMBUS_ENABLE */
            }
            break;

