nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
#if I2C_SMBUS_ENABLE
        case (uint8_t)kMasterCheckReceivedPecState:
            /* Issue STOP command before reading last PEC byte. */
            result = I2C_MasterStop(base);
            /* Read PEC byte from the data register and check with calculation. */
            if (I2C_ReadByte(base) == s_u8MasterCrcValue)
            {
                *bIsDone = true;
            }
            else
            {
                result = kStatus_I2C_Pec_Error;
            }
            break;
#endif /* I2C_SMBUS_ENABLE */

        default:
            /* Add this to fix MISRA C2012 rule 16.4 issue: Empty default. */
            assert(false);
            break;
    }

    return result;
}

void I2C_MasterTransferHandleIRQ(void *pI2CHandle)
{
    assert(NULL != pI2CHandle);

    i2c_master_transfer_handle_t *psHandle = (i2c_master_transfer_handle_t *)pI2CHandle;
    I2C_Type *base                         = psHandle->base;
    status_t result                        = kStatus_Success;
    /* When bIsDone is true, it means all the data is transferred. */
    bool bIsDone;

    /* Clear the interrupt flag. */
    I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_InterruptPendingFlag);

    /* Check transfer complete flag. */
    result = I2C_MasterTransferRunStateMachine(psHandle, &bIsDone);
#if I2C_SMBUS_ENABLE
    if (result == kStatus_I2C_ArbitrationLost)
    {
        i2c_master_transfer_direction_t direction = psHandle->sTransfer.eDirection;
        if (psHandle->sTransfer.u8CommandSize > 0u)
        {
            direction = kI2C_MasterTransmit;
        }
        while (psHandle->sTransfer.u8RetryTimes--)
        {
            if (I2C_MasterStart(base, psHandle->sTransfer.u8SlaveAddress, direction) == 0)
            {
                /* Break if start signal is successfully isued. */
                break;
            }
        }
    }
#endif /* I2C_SMBUS_ENABLE */

    /* Stop the transfer, if all the data is transferred,
       or the transfer result indicate error due slave nack or arbitration lost. */
    if ((true == bIsDone) || (0 != result))
    {
        /* Send stop command if stop signal is requested, or nacked by slave. */
        if ((0U == (psHandle->sTransfer.u8ControlFlagMask & (uint8_t)kI2C_TransferNoStopFlag)) ||
            (result == kStatus_I2C_Nak) || (result == kStatus_I2C_Addr_Nak))
        {
            /* If arbitration is lost, I2C loses master state, no need to issue stop. */
            if (I2C_IsMaster(base))
            {
                I2C_MasterStop(base);
            }
        }

        /* Restore handle to idle state. */
        psHandle->u8State = (uint8_t)kMasterIdleState;

        /* Disable interrupt. */
        I2C_DisableInterrupts(base, (uint16_t)kI2C_GlobalInterruptEnable);

#if I2C_SMBUS_ENABLE
        s_bIsMaster = false;
#endif /* I2C_SMBUS_ENABLE */

        psHandle->completionStatus = result;
        /* Call the Callback function after the function has completed. */
        if (NULL != (psHandle->pfCompletionCallback))
        {
            psHandle->pfCompletionCallback(psHandle);
        }
    }
}

void I2C_SlaveTransferHandleIRQ(void *pI2CHandle)
{
    assert(NULL != pI2CHandle);
    /* Save address byte */
    uint8_t address;
    bool bDoTransmit                      = false;
    i2c_slave_transfer_handle_t *psHandle = (i2c_slave_transfer_handle_t *)pI2CHandle;
    I2C_Type *base                        = psHandle->base;
    i2c_slave_transfer_t *psTransfer;
    uint16_t u8TmpdataSize = 0;

    uint16_t u16StatusFlags = I2C_SlaveGetStatusFlags(base);
    psTransfer              = &(psHandle->sTransfer);

#ifdef I2C_HAS_STOP_DETECT
    /* Check stop flag. */
    if (0U != (u16StatusFlags & (uint16_t)kI2C_StopDetectInterruptFlag))
    {
#if I2C_SMBUS_ENABLE
        /* Reset CRC value when stop signal */
        s_u8SlaveCrcValue = 0U;
        I2C_EnableFastAck(base, false);
#endif /* I2C_SMBUS_ENABLE */
        /* Clear the stop detect and interrupt flag. */
        I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_StopDetectInterruptFlag | (uint16_t)kI2C_InterruptPendingFlag);

        /* Bus state u8State is set to kSlaveBusyState after slave address match, and is set to kSlaveIdleState after
           slave detects nack or stop or all the user configured data is transferred. If master nacks slave, stop signal
           follows, in this case u8State is already set to kSlaveIdleState and callback invoked, so have a check of the
           state here in case before this stop detected the state is already idle. */
        if (kSlaveBusyState == psHandle->u8State)
        {
            psHandle->u8State          = kSlaveIdleState;
            psTransfer->eEvent         = kI2C_SlaveCompletionEvent;
            psHandle->completionStatus = kStatus_Success;

            /* If user configured to invoke call back when stop is detected and Callback is properly installed before
             */
            if ((0U != (psHandle->sTransfer.u8EventMask & (uint8_t)kI2C_SlaveCompletionEvent)) &&
                (NULL != psHandle->pfCallback))
            {
                psHandle->pfCallback(psHandle);
            }
        }

        if (0U == (u16StatusFlags & (uint16_t)kI2C_AddressAsSlaveInterruptFlag))
        {
            return;
        }
    }
#endif /* I2C_HAS_STOP_DETECT */

#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    /* Check start flag, repeated start can also set this flag. */
    if (0U != (u16StatusFlags & (uint16_t)kI2C_StartDetectInterruptFlag))
    {
#if I2C_SMBUS_ENABLE
        I2C_EnableFastAck(base, false);
#endif /* I2C_SMBUS_ENABLE */
        /* Clear the start detect and interrupt flag. */
        I2C_MasterClearStatusFlags(base, (uint16_t)kI2C_StartDetectInterruptFlag | (uint16_t)kI2C_InterruptPendingFlag);

        psHandle->u8State          = kSlaveBusyState;
        psTransfer->eEvent         = kI2C_SlaveStartEvent;
        psHandle->completionStatus = kStatus_Success;

        /* If user configured to invoke call back when start is detected and Callback is properly installed before */
        if ((0U != (psHandle->sTransfer.u8EventMask & (uint8_t)kI2C_SlaveStartEvent)) && (NULL != psHandle->pfCallback))
        {
            psHandle->pfCallback(psHandle);
        }

        if (0U == (u16StatusFlags & (uint16_t)kI2C_AddressAsSlaveInterruptFlag))
        {
            return;
        }
    }
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */

    /* Clear the interrupt flag. */
    I2C_MasterClearStatusFlags(base, u16StatusFlags);

