nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
#if I2C_SMBUS_ENABLE
    /* Check arbitrtion lost, slave can lost arbitrtion to alert response address. */
    if (0U != (u16StatusFlags & (uint16_t)kI2C_ArbitrationLostInterruptFlag))
    {
        /* If lost arbitration to alert response, set state to idle and invoke callback with
         * kStatus_I2C_ArbitrationLost.
         */
        psHandle->u8State          = kSlaveIdleState;
        psTransfer->eEvent         = kI2C_SlaveCompletionEvent;
        psHandle->completionStatus = kStatus_I2C_ArbitrationLost;

        if ((0U != (psHandle->sTransfer.u8EventMask & (uint8_t)kI2C_SlaveCompletionEvent)) &&
            (NULL != psHandle->pfCallback))
        {
            psHandle->pfCallback(psHandle);
        }
    }
#endif /* I2C_SMBUS_ENABLE */

    /* Check address match. */
    if (0U != (u16StatusFlags & (uint16_t)kI2C_AddressAsSlaveInterruptFlag))
    {
#if I2C_SMBUS_ENABLE
        I2C_EnableFastAck(base, false);
#endif /* I2C_SMBUS_ENABLE */
        /* Set transfer state to busy to indicate that a transfer is in process. */
        psHandle->u8State          = kSlaveBusyState;
        psHandle->completionStatus = kStatus_Success;
        /* Save the address match event. */
        psTransfer->eEvent = kI2C_SlaveAddressMatchEvent;
        /* Slave transmit, master reading from slave. */
        if (0U != (u16StatusFlags & (uint16_t)kI2C_SlaveTransmitFlag))
        {
            /* Change direction to send data. */
            bDoTransmit = true;
            I2C_SetTransferDirection(base, kI2C_Write);
#if I2C_SMBUS_ENABLE
            address = I2C_ReadByte(base);
            if (address == 0x19U)
            {
                /* Data read out is 0x19, indicates this is a alert response, change the event to alert response. */
                psTransfer->eEvent = kI2C_SlaveAlertResponseEvent;
                /* Send back slave's own address immediately to response. */
                I2C_WriteByte(base, (uint8_t)((base->A1 & I2C_A1_AD_MASK) >> 1U));
            }
            I2C_UpdateCrc8(&s_u8SlaveCrcValue, &address, 1U);
#endif /* I2C_SMBUS_ENABLE */
        }
        else
        {
            /* Slave receive, master writing to slave. */
            I2C_SetTransferDirection(base, kI2C_Read);
            address = I2C_ReadByte(base);
            if (address == 0U)
            {
                /* Data read out is 0x00, indicates this is a general call, change the event to general call. */
                psTransfer->eEvent = kI2C_SlaveGenaralcallEvent;
            }
#if I2C_SMBUS_ENABLE
            I2C_UpdateCrc8(&s_u8SlaveCrcValue, &address, 1U);
#endif /* I2C_SMBUS_ENABLE */
        }

        if ((0U != (psHandle->sTransfer.u8EventMask & (uint8_t)psTransfer->eEvent)) && (NULL != psHandle->pfCallback))
        {
            psHandle->pfCallback(psHandle);
        }
    }
    /* Check NAK */
    else if (0U != (u16StatusFlags & (uint16_t)kI2C_ReceiveNakFlag))
    {
        /* Change direction to receive. */
        I2C_SetTransferDirection(base, kI2C_Read);

        /* Read dummy data to release bus. */
        (void)I2C_ReadByte(base);
#if I2C_SMBUS_ENABLE
        if ((psHandle->sTransfer.u16DataSize == 0U) && (psHandle->u8State == (uint8_t)kSlaveSendPECState))
#else
        if (psHandle->sTransfer.u16DataSize == 0U)
#endif /* I2C_SMBUS_ENABLE */
        {
#ifndef I2C_HAS_STOP_DETECT
            /* When nacked by master at the last byte,
            set event to slave complete, status to kStatus_Success and set state to idle. */
            psHandle->u8State          = kSlaveIdleState;
            psTransfer->eEvent         = kI2C_SlaveCompletionEvent;
            psHandle->completionStatus = kStatus_Success;

            if ((0U != (psHandle->sTransfer.u8EventMask & (uint8_t)kI2C_SlaveCompletionEvent)) &&
                (NULL != psHandle->pfCallback))
            {
                psHandle->pfCallback(psHandle);
            }
#endif /* I2C_HAS_STOP_DETECT */
        }
        else
        {
            /* When nacked by master before all the data finished transfer,
               set event to slave complete, status to kStatus_I2C_Nak and set stste back to idle. */
            psHandle->u8State          = kSlaveIdleState;
            psTransfer->eEvent         = kI2C_SlaveCompletionEvent;
            psHandle->completionStatus = kStatus_I2C_Nak;

            if ((0U != (psHandle->sTransfer.u8EventMask & (uint8_t)kI2C_SlaveCompletionEvent)) &&
                (NULL != psHandle->pfCallback))
            {
                psHandle->pfCallback(psHandle);
            }
        }
    }
    /* Check byte transfer complete flag. */
    else if (0U != (u16StatusFlags & (uint16_t)kI2C_ByteTransferCompleteInterruptFlag))
    {
        /* Slave transmit, master reading from slave. */
        if (0U != (u16StatusFlags & (uint16_t)kI2C_SlaveTransmitFlag))
        {
            bDoTransmit = true;
        }
        else /* Slave receive, master sending to slave. */
        {
#if I2C_SMBUS_ENABLE
            if (psHandle->u8State == (uint8_t)kSlaveCheckReceivedPecState)
            {
                psHandle->completionStatus = kStatus_Success;
                if (I2C_ReadByte(base) == s_u8SlaveCrcValue)
                {
                    I2C_AckByte(base, true);
                }
                else
                {
                    I2C_AckByte(base, false);
                    psHandle->completionStatus = kStatus_I2C_Pec_Error;
                }
                I2C_EnableFastAck(base, false);
                /* Reset CRC value after calculation. */
                s_u8SlaveCrcValue  = 0U;
                psHandle->u8State  = kSlaveIdleState;
                psTransfer->eEvent = kI2C_SlaveCompletionEvent;

                if (NULL != psHandle->pfCallback)
                {
                    psHandle->pfCallback(psHandle);
                }
            }
            else
            {
#endif /* I2C_SMBUS_ENABLE */
                u8TmpdataSize = psTransfer->u16DataSize;
                /* If we're out of space to store data, invoke pfCallback to get more. */
                if ((NULL == psTransfer->pu8Data) || (0U == u8TmpdataSize))
                {
                    psTransfer->eEvent         = kI2C_SlaveOutofReceiveSpaceEvent;
                    psHandle->completionStatus = kStatus_Success;

