nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.c
                    if (NULL != psHandle->pfCallback)
                    {
                        psHandle->pfCallback(psHandle);
                    }

                    /* Clear the transferred count now that we have a new buffer. */
                    psHandle->u16TransferredCount = 0;
                }

                /* Slave receive, master writing to slave. */
                uint8_t data = I2C_ReadByte(base);
#if I2C_SMBUS_ENABLE
                I2C_UpdateCrc8(&s_u8SlaveCrcValue, &data, 1U);
#endif /* I2C_SMBUS_ENABLE */

                if (0U != (psHandle->sTransfer.u16DataSize))
                {
                    /* Receive data. */
                    *psHandle->sTransfer.pu8Data++ = data;
                    psHandle->sTransfer.u16DataSize--;
                    psHandle->u16TransferredCount++;
                    if (0U == psHandle->sTransfer.u16DataSize)
                    {
#if I2C_SMBUS_ENABLE
                        psHandle->u8State = (uint8_t)kSlaveCheckReceivedPecState;
                        I2C_EnableFastAck(base, true);
#else /* I2C_SMBUS_ENABLE */
#ifndef I2C_HAS_STOP_DETECT
                    /* When finishes transfer, set event to slave complete, status to kStatus_Success
                       and set state back to idle. */
                    psHandle->u8State          = kSlaveIdleState;
                    psTransfer->eEvent         = kI2C_SlaveCompletionEvent;
                    psHandle->completionStatus = kStatus_Success;

                    /* Proceed receive complete event. */
                    if (((psHandle->u8EventMask & (uint8_t)kI2C_SlaveCompletionEvent) != 0U) &&
                        (psHandle->pfCallback != NULL))
                    {
                        psHandle->pfCallback(psHandle);
                    }
#endif /* I2C_HAS_STOP_DETECT */
#endif /* I2C_SMBUS_ENABLE */
                    }
                }
#if I2C_SMBUS_ENABLE
            }
#endif /* I2C_SMBUS_ENABLE */
        }
    }
    else
    {
        /* Read dummy to release bus. */
        (void)I2C_ReadByte(base);
    }

    /* Send data if there is the need. */
    if (bDoTransmit)
    {
        uint8_t u8TmpdataSize = psTransfer->u16DataSize;

        /* If we're out of data to send, invoke pfCallback to get more. */
#if I2C_SMBUS_ENABLE
        if (((NULL == psTransfer->pu8Data) || (0U == u8TmpdataSize)) &&
            (psHandle->u8State != (uint8_t)kSlaveSendPECState))
#else
        if ((NULL == psTransfer->pu8Data) || (0U == u8TmpdataSize))
#endif
        {
            psTransfer->eEvent         = kI2C_SlaveOutofTransmitDataEvent;
            psHandle->completionStatus = kStatus_Success;

            if (NULL != psHandle->pfCallback)
            {
                psHandle->pfCallback(psHandle);
            }

            /* Clear the transferred count now that we have a new buffer. */
            psHandle->u16TransferredCount = 0;
        }
#if (!I2C_SMBUS_ENABLE)
        if (0U != (psHandle->sTransfer.u16DataSize))
        {
#else
        if ((0U != (psHandle->sTransfer.u16DataSize)) || (psHandle->u8State == (uint8_t)kSlaveSendPECState))
        {
            if (psHandle->u8State == (uint8_t)kSlaveSendPECState)
            {
                I2C_WriteByte(base, s_u8SlaveCrcValue);
                psHandle->u8State = kSlaveIdleState;
            }
            else
            {
                I2C_UpdateCrc8(&s_u8SlaveCrcValue, psHandle->sTransfer.pu8Data, 1U);
#endif
            /* Send data. */
            I2C_WriteByte(base, *psHandle->sTransfer.pu8Data++);
            psHandle->sTransfer.u16DataSize--;
            psHandle->u16TransferredCount++;
#if I2C_SMBUS_ENABLE
            if (psHandle->sTransfer.u16DataSize == 0U)
            {
                psHandle->u8State = (uint8_t)kSlaveSendPECState;
            }
        }
#endif /* I2C_SMBUS_ENABLE */
    }
    else
    {
        /* Switch to receive mode. */
        I2C_SetTransferDirection(base, kI2C_Read);

        /* Read dummy to release bus. */
        (void)I2C_ReadByte(base);

#if (!I2C_SMBUS_ENABLE)
#ifndef I2C_HAS_STOP_DETECT
        /* When finishes transfer, set event to slave complete, status to kStatus_Success
           and set state back to idle. */
        psHandle->u8State  = kSlaveIdleState;
        psTransfer->eEvent = kI2C_SlaveCompletionEvent;

        /* Proceed transmit done event. */
        if (((psHandle->u8EventMask & (uint8_t)kI2C_SlaveCompletionEvent) != 0U) && (psHandle->pfCallback != NULL))
        {
            psHandle->pfCallback(psHandle);
        }
#endif /* !FSL_FEATURE_I2C_HAS_START_STOP_DETECT or !FSL_FEATURE_I2C_HAS_STOP_DETECT */
#endif /* I2C_SMBUS_ENABLE */
    }
}
}

#if I2C_SMBUS_ENABLE
void I2C_UpdateCrc8(uint8_t *pu8CrcValue, uint8_t *pu8Data, uint16_t u16ByteCount)
{
    uint8_t u8Crc = *pu8CrcValue;
    uint8_t i;

    while (u16ByteCount--)
    {
        u8Crc ^= *pu8Data++;
        for (i = 0U; i < 8U; ++i)
        {
            if (u8Crc & 0x80U)
            {
                u8Crc = (u8Crc << 1) ^ 0xE0;
            }
            else
            {
                u8Crc = u8Crc << 1;
            }
        }
    }

    *pu8CrcValue = u8Crc;
}
#endif /* I2C_SMBUS_ENABLE */

static void I2C_TransferCommonIRQHandler(I2C_Type *base, void *pHandle)
{
    uint8_t u8TmpC1 = base->C1;

#if I2C_SMBUS_ENABLE
    /* Check if I2C is in master state, when in SMBus mode the arbitration lost can also happen when slave react to
     * alert response. */
    if (I2C_IsMaster(base) || (s_bIsMaster))
#else  /* I2C_SMBUS_ENABLE */
        uint16_t u16TmpS = I2C_MasterGetStatusFlags(base);
        /* Check if I2C is in master state, when arbitration lost master state will switch to slave state. */
        if (I2C_IsMaster(base) || (0U != (u16TmpS & (uint16_t)kI2C_ArbitrationLostInterruptFlag)))
#endif /* I2C_SMBUS_ENABLE */
    {
        s_pfI2cMasterIsr(pHandle);
    }
    else
    {
        s_pfI2cSlaveIsr(pHandle);
    }
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}
/* ======================================== End of Driver Internal Functions ======================================== */

/*!
 * brief Gets instance number for I2C module.
 *
 * param base I2C base pointer.
 * retval The number of the instance.
 */
uint32_t I2C_GetInstance(I2C_Type *base)
{
    uint32_t u32Instance;

    /* Find the instance index from base address mappings. */
    for (u32Instance = 0; u32Instance < ARRAY_SIZE(s_pfI2cBases); u32Instance++)
    {
        if (s_pfI2cBases[u32Instance] == base)
        {
            break;
        }
    }

    assert(u32Instance < ARRAY_SIZE(s_pfI2cBases));

    return u32Instance;
}

/* ======================================= Second Layer IRQhandler defintion ======================================== */
#if defined(FSL_FEATURE_I2C_HAS_SHARED_IRQ0_IRQ1) && FSL_FEATURE_I2C_HAS_SHARED_IRQ0_IRQ1
void I2C0_I2C1_DriverIRQHandler(void);
void I2C0_I2C1_DriverIRQHandler(void)
{
    for (uint32_t instance = 0U; instance < 2U; instance++)
    {
        if (s_pI2cHandles[instance] != NULL)
        {
            I2C_TransferCommonIRQHandler(s_pfI2cBases[instance], s_pI2cHandles[instance]);
        }
    }
}
#else
#if defined(I2C0)
    void I2C0_DriverIRQHandler(void);
    void I2C0_DriverIRQHandler(void)
    {
        I2C_TransferCommonIRQHandler(I2C0, s_pI2cHandles[0]);
    }
#endif

#if defined(I2C1)
    void I2C1_DriverIRQHandler(void);
    void I2C1_DriverIRQHandler(void)
    {
        I2C_TransferCommonIRQHandler(I2C1, s_pI2cHandles[1]);
    }
#endif
#endif

#if defined(I2C2)
void I2C2_DriverIRQHandler(void);
void I2C2_DriverIRQHandler(void)
{
    I2C_TransferCommonIRQHandler(I2C2, s_pI2cHandles[2]);
}
#endif

#if defined(I2C3)
void I2C3_DriverIRQHandler(void);
void I2C3_DriverIRQHandler(void)
{
    I2C_TransferCommonIRQHandler(I2C3, s_pI2cHandles[3]);
}
#endif
/* =================================== End of Second Layer IRQhandler definition ==================================== */
